Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/firmware/src/packs/PIC32CZ2051CA70144_DFP/component/mcan.h
/* -------- MCAN_ILS : (MCAN Offset: 0x58) (R/W 32) Interrupt Line Select Register -------- */
#define MCAN_ILS_RF0NL_Pos                    _UINT32_(0)                                          /* (MCAN_ILS) Receive FIFO 0 New Message Interrupt Line Position */
#define MCAN_ILS_RF0NL_Msk                    (_UINT32_(0x1) << MCAN_ILS_RF0NL_Pos)                /* (MCAN_ILS) Receive FIFO 0 New Message Interrupt Line Mask */
#define MCAN_ILS_RF0NL(value)                 (MCAN_ILS_RF0NL_Msk & (_UINT32_(value) << MCAN_ILS_RF0NL_Pos)) /* Assigment of value for RF0NL in the MCAN_ILS register */
#define MCAN_ILS_RF0WL_Pos                    _UINT32_(1)                                          /* (MCAN_ILS) Receive FIFO 0 Watermark Reached Interrupt Line Position */
#define MCAN_ILS_RF0WL_Msk                    (_UINT32_(0x1) << MCAN_ILS_RF0WL_Pos)                /* (MCAN_ILS) Receive FIFO 0 Watermark Reached Interrupt Line Mask */
#define MCAN_ILS_RF0WL(value)                 (MCAN_ILS_RF0WL_Msk & (_UINT32_(value) << MCAN_ILS_RF0WL_Pos)) /* Assigment of value for RF0WL in the MCAN_ILS register */
#define MCAN_ILS_RF0FL_Pos                    _UINT32_(2)                                          /* (MCAN_ILS) Receive FIFO 0 Full Interrupt Line Position */
#define MCAN_ILS_RF0FL_Msk                    (_UINT32_(0x1) << MCAN_ILS_RF0FL_Pos)                /* (MCAN_ILS) Receive FIFO 0 Full Interrupt Line Mask */
#define MCAN_ILS_RF0FL(value)                 (MCAN_ILS_RF0FL_Msk & (_UINT32_(value) << MCAN_ILS_RF0FL_Pos)) /* Assigment of value for RF0FL in the MCAN_ILS register */
#define MCAN_ILS_RF0LL_Pos                    _UINT32_(3)                                          /* (MCAN_ILS) Receive FIFO 0 Message Lost Interrupt Line Position */
#define MCAN_ILS_RF0LL_Msk                    (_UINT32_(0x1) << MCAN_ILS_RF0LL_Pos)                /* (MCAN_ILS) Receive FIFO 0 Message Lost Interrupt Line Mask */
#define MCAN_ILS_RF0LL(value)                 (MCAN_ILS_RF0LL_Msk & (_UINT32_(value) << MCAN_ILS_RF0LL_Pos)) /* Assigment of value for RF0LL in the MCAN_ILS register */
#define MCAN_ILS_RF1NL_Pos                    _UINT32_(4)                                          /* (MCAN_ILS) Receive FIFO 1 New Message Interrupt Line Position */
#define MCAN_ILS_RF1NL_Msk                    (_UINT32_(0x1) << MCAN_ILS_RF1NL_Pos)                /* (MCAN_ILS) Receive FIFO 1 New Message Interrupt Line Mask */
#define MCAN_ILS_RF1NL(value)                 (MCAN_ILS_RF1NL_Msk & (_UINT32_(value) << MCAN_ILS_RF1NL_Pos)) /* Assigment of value for RF1NL in the MCAN_ILS register */
#define MCAN_ILS_RF1WL_Pos                    _UINT32_(5)                                          /* (MCAN_ILS) Receive FIFO 1 Watermark Reached Interrupt Line Position */
#define MCAN_ILS_RF1WL_Msk                    (_UINT32_(0x1) << MCAN_ILS_RF1WL_Pos)                /* (MCAN_ILS) Receive FIFO 1 Watermark Reached Interrupt Line Mask */
#define MCAN_ILS_RF1WL(value)                 (MCAN_ILS_RF1WL_Msk & (_UINT32_(value) << MCAN_ILS_RF1WL_Pos)) /* Assigment of value for RF1WL in the MCAN_ILS register */
#define MCAN_ILS_RF1FL_Pos                    _UINT32_(6)                                          /* (MCAN_ILS) Receive FIFO 1 Full Interrupt Line Position */
#define MCAN_ILS_RF1FL_Msk                    (_UINT32_(0x1) << MCAN_ILS_RF1FL_Pos)                /* (MCAN_ILS) Receive FIFO 1 Full Interrupt Line Mask */
#define MCAN_ILS_RF1FL(value)                 (MCAN_ILS_RF1FL_Msk & (_UINT32_(value) << MCAN_ILS_RF1FL_Pos)) /* Assigment of value for RF1FL in the MCAN_ILS register */
#define MCAN_ILS_RF1LL_Pos                    _UINT32_(7)                                          /* (MCAN_ILS) Receive FIFO 1 Message Lost Interrupt Line Position */
#define MCAN_ILS_RF1LL_Msk                    (_UINT32_(0x1) << MCAN_ILS_RF1LL_Pos)                /* (MCAN_ILS) Receive FIFO 1 Message Lost Interrupt Line Mask */
#define MCAN_ILS_RF1LL(value)                 (MCAN_ILS_RF1LL_Msk & (_UINT32_(value) << MCAN_ILS_RF1LL_Pos)) /* Assigment of value for RF1LL in the MCAN_ILS register */
#define MCAN_ILS_HPML_Pos                     _UINT32_(8)                                          /* (MCAN_ILS) High Priority Message Interrupt Line Position */
#define MCAN_ILS_HPML_Msk                     (_UINT32_(0x1) << MCAN_ILS_HPML_Pos)                 /* (MCAN_ILS) High Priority Message Interrupt Line Mask */
#define MCAN_ILS_HPML(value)                  (MCAN_ILS_HPML_Msk & (_UINT32_(value) << MCAN_ILS_HPML_Pos)) /* Assigment of value for HPML in the MCAN_ILS register */
#define MCAN_ILS_TCL_Pos                      _UINT32_(9)                                          /* (MCAN_ILS) Transmission Completed Interrupt Line Position */
#define MCAN_ILS_TCL_Msk                      (_UINT32_(0x1) << MCAN_ILS_TCL_Pos)                  /* (MCAN_ILS) Transmission Completed Interrupt Line Mask */
#define MCAN_ILS_TCL(value)                   (MCAN_ILS_TCL_Msk & (_UINT32_(value) << MCAN_ILS_TCL_Pos)) /* Assigment of value for TCL in the MCAN_ILS register */
#define MCAN_ILS_TCFL_Pos                     _UINT32_(10)                                         /* (MCAN_ILS) Transmission Cancellation Finished Interrupt Line Position */
#define MCAN_ILS_TCFL_Msk                     (_UINT32_(0x1) << MCAN_ILS_TCFL_Pos)                 /* (MCAN_ILS) Transmission Cancellation Finished Interrupt Line Mask */
#define MCAN_ILS_TCFL(value)                  (MCAN_ILS_TCFL_Msk & (_UINT32_(value) << MCAN_ILS_TCFL_Pos)) /* Assigment of value for TCFL in the MCAN_ILS register */
#define MCAN_ILS_TFEL_Pos                     _UINT32_(11)                                         /* (MCAN_ILS) Tx FIFO Empty Interrupt Line Position */
#define MCAN_ILS_TFEL_Msk                     (_UINT32_(0x1) << MCAN_ILS_TFEL_Pos)                 /* (MCAN_ILS) Tx FIFO Empty Interrupt Line Mask */
#define MCAN_ILS_TFEL(value)                  (MCAN_ILS_TFEL_Msk & (_UINT32_(value) << MCAN_ILS_TFEL_Pos)) /* Assigment of value for TFEL in the MCAN_ILS register */
#define MCAN_ILS_TEFNL_Pos                    _UINT32_(12)                                         /* (MCAN_ILS) Tx Event FIFO New Entry Interrupt Line Position */
#define MCAN_ILS_TEFNL_Msk                    (_UINT32_(0x1) << MCAN_ILS_TEFNL_Pos)                /* (MCAN_ILS) Tx Event FIFO New Entry Interrupt Line Mask */
#define MCAN_ILS_TEFNL(value)                 (MCAN_ILS_TEFNL_Msk & (_UINT32_(value) << MCAN_ILS_TEFNL_Pos)) /* Assigment of value for TEFNL in the MCAN_ILS register */
#define MCAN_ILS_TEFWL_Pos                    _UINT32_(13)                                         /* (MCAN_ILS) Tx Event FIFO Watermark Reached Interrupt Line Position */
#define MCAN_ILS_TEFWL_Msk                    (_UINT32_(0x1) << MCAN_ILS_TEFWL_Pos)                /* (MCAN_ILS) Tx Event FIFO Watermark Reached Interrupt Line Mask */
#define MCAN_ILS_TEFWL(value)                 (MCAN_ILS_TEFWL_Msk & (_UINT32_(value) << MCAN_ILS_TEFWL_Pos)) /* Assigment of value for TEFWL in the MCAN_ILS register */
#define MCAN_ILS_TEFFL_Pos                    _UINT32_(14)                                         /* (MCAN_ILS) Tx Event FIFO Full Interrupt Line Position */
#define MCAN_ILS_TEFFL_Msk                    (_UINT32_(0x1) << MCAN_ILS_TEFFL_Pos)                /* (MCAN_ILS) Tx Event FIFO Full Interrupt Line Mask */
#define MCAN_ILS_TEFFL(value)                 (MCAN_ILS_TEFFL_Msk & (_UINT32_(value) << MCAN_ILS_TEFFL_Pos)) /* Assigment of value for TEFFL in the MCAN_ILS register */
#define MCAN_ILS_TEFLL_Pos                    _UINT32_(15)                                         /* (MCAN_ILS) Tx Event FIFO Event Lost Interrupt Line Position */
#define MCAN_ILS_TEFLL_Msk                    (_UINT32_(0x1) << MCAN_ILS_TEFLL_Pos)                /* (MCAN_ILS) Tx Event FIFO Event Lost Interrupt Line Mask */
#define MCAN_ILS_TEFLL(value)                 (MCAN_ILS_TEFLL_Msk & (_UINT32_(value) << MCAN_ILS_TEFLL_Pos)) /* Assigment of value for TEFLL in the MCAN_ILS register */
#define MCAN_ILS_TSWL_Pos                     _UINT32_(16)                                         /* (MCAN_ILS) Timestamp Wraparound Interrupt Line Position */
#define MCAN_ILS_TSWL_Msk                     (_UINT32_(0x1) << MCAN_ILS_TSWL_Pos)                 /* (MCAN_ILS) Timestamp Wraparound Interrupt Line Mask */
#define MCAN_ILS_TSWL(value)                  (MCAN_ILS_TSWL_Msk & (_UINT32_(value) << MCAN_ILS_TSWL_Pos)) /* Assigment of value for TSWL in the MCAN_ILS register */
#define MCAN_ILS_MRAFL_Pos                    _UINT32_(17)                                         /* (MCAN_ILS) Message RAM Access Failure Interrupt Line Position */
#define MCAN_ILS_MRAFL_Msk                    (_UINT32_(0x1) << MCAN_ILS_MRAFL_Pos)                /* (MCAN_ILS) Message RAM Access Failure Interrupt Line Mask */
#define MCAN_ILS_MRAFL(value)                 (MCAN_ILS_MRAFL_Msk & (_UINT32_(value) << MCAN_ILS_MRAFL_Pos)) /* Assigment of value for MRAFL in the MCAN_ILS register */
#define MCAN_ILS_TOOL_Pos                     _UINT32_(18)                                         /* (MCAN_ILS) Timeout Occurred Interrupt Line Position */
#define MCAN_ILS_TOOL_Msk                     (_UINT32_(0x1) << MCAN_ILS_TOOL_Pos)                 /* (MCAN_ILS) Timeout Occurred Interrupt Line Mask */
#define MCAN_ILS_TOOL(value)                  (MCAN_ILS_TOOL_Msk & (_UINT32_(value) << MCAN_ILS_TOOL_Pos)) /* Assigment of value for TOOL in the MCAN_ILS register */
#define MCAN_ILS_DRXL_Pos                     _UINT32_(19)                                         /* (MCAN_ILS) Message stored to Dedicated Receive Buffer Interrupt Line Position */
#define MCAN_ILS_DRXL_Msk                     (_UINT32_(0x1) << MCAN_ILS_DRXL_Pos)                 /* (MCAN_ILS) Message stored to Dedicated Receive Buffer Interrupt Line Mask */
#define MCAN_ILS_DRXL(value)                  (MCAN_ILS_DRXL_Msk & (_UINT32_(value) << MCAN_ILS_DRXL_Pos)) /* Assigment of value for DRXL in the MCAN_ILS register */
#define MCAN_ILS_ELOL_Pos                     _UINT32_(22)                                         /* (MCAN_ILS) Error Logging Overflow Interrupt Line Position */
#define MCAN_ILS_ELOL_Msk                     (_UINT32_(0x1) << MCAN_ILS_ELOL_Pos)                 /* (MCAN_ILS) Error Logging Overflow Interrupt Line Mask */
#define MCAN_ILS_ELOL(value)                  (MCAN_ILS_ELOL_Msk & (_UINT32_(value) << MCAN_ILS_ELOL_Pos)) /* Assigment of value for ELOL in the MCAN_ILS register */
#define MCAN_ILS_EPL_Pos                      _UINT32_(23)                                         /* (MCAN_ILS) Error Passive Interrupt Line Position */
#define MCAN_ILS_EPL_Msk                      (_UINT32_(0x1) << MCAN_ILS_EPL_Pos)                  /* (MCAN_ILS) Error Passive Interrupt Line Mask */
#define MCAN_ILS_EPL(value)                   (MCAN_ILS_EPL_Msk & (_UINT32_(value) << MCAN_ILS_EPL_Pos)) /* Assigment of value for EPL in the MCAN_ILS register */
#define MCAN_ILS_EWL_Pos                      _UINT32_(24)                                         /* (MCAN_ILS) Warning Status Interrupt Line Position */
#define MCAN_ILS_EWL_Msk                      (_UINT32_(0x1) << MCAN_ILS_EWL_Pos)                  /* (MCAN_ILS) Warning Status Interrupt Line Mask */
#define MCAN_ILS_EWL(value)                   (MCAN_ILS_EWL_Msk & (_UINT32_(value) << MCAN_ILS_EWL_Pos)) /* Assigment of value for EWL in the MCAN_ILS register */
#define MCAN_ILS_BOL_Pos                      _UINT32_(25)                                         /* (MCAN_ILS) Bus_Off Status Interrupt Line Position */
#define MCAN_ILS_BOL_Msk                      (_UINT32_(0x1) << MCAN_ILS_BOL_Pos)                  /* (MCAN_ILS) Bus_Off Status Interrupt Line Mask */
#define MCAN_ILS_BOL(value)                   (MCAN_ILS_BOL_Msk & (_UINT32_(value) << MCAN_ILS_BOL_Pos)) /* Assigment of value for BOL in the MCAN_ILS register */
#define MCAN_ILS_WDIL_Pos                     _UINT32_(26)                                         /* (MCAN_ILS) Watchdog Interrupt Line Position */
#define MCAN_ILS_WDIL_Msk                     (_UINT32_(0x1) << MCAN_ILS_WDIL_Pos)                 /* (MCAN_ILS) Watchdog Interrupt Line Mask */
#define MCAN_ILS_WDIL(value)                  (MCAN_ILS_WDIL_Msk & (_UINT32_(value) << MCAN_ILS_WDIL_Pos)) /* Assigment of value for WDIL in the MCAN_ILS register */
#define MCAN_ILS_PEAL_Pos                     _UINT32_(27)                                         /* (MCAN_ILS) Protocol Error in Arbitration Phase Line Position */
#define MCAN_ILS_PEAL_Msk                     (_UINT32_(0x1) << MCAN_ILS_PEAL_Pos)                 /* (MCAN_ILS) Protocol Error in Arbitration Phase Line Mask */
#define MCAN_ILS_PEAL(value)                  (MCAN_ILS_PEAL_Msk & (_UINT32_(value) << MCAN_ILS_PEAL_Pos)) /* Assigment of value for PEAL in the MCAN_ILS register */
#define MCAN_ILS_PEDL_Pos                     _UINT32_(28)                                         /* (MCAN_ILS) Protocol Error in Data Phase Line Position */
#define MCAN_ILS_PEDL_Msk                     (_UINT32_(0x1) << MCAN_ILS_PEDL_Pos)                 /* (MCAN_ILS) Protocol Error in Data Phase Line Mask */
#define MCAN_ILS_PEDL(value)                  (MCAN_ILS_PEDL_Msk & (_UINT32_(value) << MCAN_ILS_PEDL_Pos)) /* Assigment of value for PEDL in the MCAN_ILS register */
#define MCAN_ILS_ARAL_Pos                     _UINT32_(29)                                         /* (MCAN_ILS) Access to Reserved Address Line Position */
#define MCAN_ILS_ARAL_Msk                     (_UINT32_(0x1) << MCAN_ILS_ARAL_Pos)                 /* (MCAN_ILS) Access to Reserved Address Line Mask */
#define MCAN_ILS_ARAL(value)                  (MCAN_ILS_ARAL_Msk & (_UINT32_(value) << MCAN_ILS_ARAL_Pos)) /* Assigment of value for ARAL in the MCAN_ILS register */
#define MCAN_ILS_Msk                          _UINT32_(0x3FCFFFFF)                                 /* (MCAN_ILS) Register Mask  */


/* -------- MCAN_ILE : (MCAN Offset: 0x5C) (R/W 32) Interrupt Line Enable Register -------- */
#define MCAN_ILE_EINT0_Pos                    _UINT32_(0)                                          /* (MCAN_ILE) Enable Interrupt Line 0 Position */
#define MCAN_ILE_EINT0_Msk                    (_UINT32_(0x1) << MCAN_ILE_EINT0_Pos)                /* (MCAN_ILE) Enable Interrupt Line 0 Mask */
#define MCAN_ILE_EINT0(value)                 (MCAN_ILE_EINT0_Msk & (_UINT32_(value) << MCAN_ILE_EINT0_Pos)) /* Assigment of value for EINT0 in the MCAN_ILE register */
#define MCAN_ILE_EINT1_Pos                    _UINT32_(1)                                          /* (MCAN_ILE) Enable Interrupt Line 1 Position */
#define MCAN_ILE_EINT1_Msk                    (_UINT32_(0x1) << MCAN_ILE_EINT1_Pos)                /* (MCAN_ILE) Enable Interrupt Line 1 Mask */
#define MCAN_ILE_EINT1(value)                 (MCAN_ILE_EINT1_Msk & (_UINT32_(value) << MCAN_ILE_EINT1_Pos)) /* Assigment of value for EINT1 in the MCAN_ILE register */
#define MCAN_ILE_Msk                          _UINT32_(0x00000003)                                 /* (MCAN_ILE) Register Mask  */

