Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/firmware/src/packs/PIC32CZ2051CA70144_DFP/component/mcan.h
/* -------- MCAN_RXF0S : (MCAN Offset: 0xA4) ( R/ 32) Receive FIFO 0 Status Register -------- */
#define MCAN_RXF0S_F0FL_Pos                   _UINT32_(0)                                          /* (MCAN_RXF0S) Receive FIFO 0 Fill Level Position */
#define MCAN_RXF0S_F0FL_Msk                   (_UINT32_(0x7F) << MCAN_RXF0S_F0FL_Pos)              /* (MCAN_RXF0S) Receive FIFO 0 Fill Level Mask */
#define MCAN_RXF0S_F0FL(value)                (MCAN_RXF0S_F0FL_Msk & (_UINT32_(value) << MCAN_RXF0S_F0FL_Pos)) /* Assigment of value for F0FL in the MCAN_RXF0S register */
#define MCAN_RXF0S_F0GI_Pos                   _UINT32_(8)                                          /* (MCAN_RXF0S) Receive FIFO 0 Get Index Position */
#define MCAN_RXF0S_F0GI_Msk                   (_UINT32_(0x3F) << MCAN_RXF0S_F0GI_Pos)              /* (MCAN_RXF0S) Receive FIFO 0 Get Index Mask */
#define MCAN_RXF0S_F0GI(value)                (MCAN_RXF0S_F0GI_Msk & (_UINT32_(value) << MCAN_RXF0S_F0GI_Pos)) /* Assigment of value for F0GI in the MCAN_RXF0S register */
#define MCAN_RXF0S_F0PI_Pos                   _UINT32_(16)                                         /* (MCAN_RXF0S) Receive FIFO 0 Put Index Position */
#define MCAN_RXF0S_F0PI_Msk                   (_UINT32_(0x3F) << MCAN_RXF0S_F0PI_Pos)              /* (MCAN_RXF0S) Receive FIFO 0 Put Index Mask */
#define MCAN_RXF0S_F0PI(value)                (MCAN_RXF0S_F0PI_Msk & (_UINT32_(value) << MCAN_RXF0S_F0PI_Pos)) /* Assigment of value for F0PI in the MCAN_RXF0S register */
#define MCAN_RXF0S_F0F_Pos                    _UINT32_(24)                                         /* (MCAN_RXF0S) Receive FIFO 0 Fill Level Position */
#define MCAN_RXF0S_F0F_Msk                    (_UINT32_(0x1) << MCAN_RXF0S_F0F_Pos)                /* (MCAN_RXF0S) Receive FIFO 0 Fill Level Mask */
#define MCAN_RXF0S_F0F(value)                 (MCAN_RXF0S_F0F_Msk & (_UINT32_(value) << MCAN_RXF0S_F0F_Pos)) /* Assigment of value for F0F in the MCAN_RXF0S register */
#define MCAN_RXF0S_RF0L_Pos                   _UINT32_(25)                                         /* (MCAN_RXF0S) Receive FIFO 0 Message Lost Position */
#define MCAN_RXF0S_RF0L_Msk                   (_UINT32_(0x1) << MCAN_RXF0S_RF0L_Pos)               /* (MCAN_RXF0S) Receive FIFO 0 Message Lost Mask */
#define MCAN_RXF0S_RF0L(value)                (MCAN_RXF0S_RF0L_Msk & (_UINT32_(value) << MCAN_RXF0S_RF0L_Pos)) /* Assigment of value for RF0L in the MCAN_RXF0S register */
#define MCAN_RXF0S_Msk                        _UINT32_(0x033F3F7F)                                 /* (MCAN_RXF0S) Register Mask  */


/* -------- MCAN_RXF0A : (MCAN Offset: 0xA8) (R/W 32) Receive FIFO 0 Acknowledge Register -------- */
#define MCAN_RXF0A_F0AI_Pos                   _UINT32_(0)                                          /* (MCAN_RXF0A) Receive FIFO 0 Acknowledge Index Position */
#define MCAN_RXF0A_F0AI_Msk                   (_UINT32_(0x3F) << MCAN_RXF0A_F0AI_Pos)              /* (MCAN_RXF0A) Receive FIFO 0 Acknowledge Index Mask */
#define MCAN_RXF0A_F0AI(value)                (MCAN_RXF0A_F0AI_Msk & (_UINT32_(value) << MCAN_RXF0A_F0AI_Pos)) /* Assigment of value for F0AI in the MCAN_RXF0A register */
#define MCAN_RXF0A_Msk                        _UINT32_(0x0000003F)                                 /* (MCAN_RXF0A) Register Mask  */


/* -------- MCAN_RXBC : (MCAN Offset: 0xAC) (R/W 32) Receive Rx Buffer Configuration Register -------- */
#define MCAN_RXBC_RBSA_Pos                    _UINT32_(2)                                          /* (MCAN_RXBC) Receive Buffer Start Address Position */
#define MCAN_RXBC_RBSA_Msk                    (_UINT32_(0x3FFF) << MCAN_RXBC_RBSA_Pos)             /* (MCAN_RXBC) Receive Buffer Start Address Mask */
#define MCAN_RXBC_RBSA(value)                 (MCAN_RXBC_RBSA_Msk & (_UINT32_(value) << MCAN_RXBC_RBSA_Pos)) /* Assigment of value for RBSA in the MCAN_RXBC register */
#define MCAN_RXBC_Msk                         _UINT32_(0x0000FFFC)                                 /* (MCAN_RXBC) Register Mask  */


/* -------- MCAN_RXF1C : (MCAN Offset: 0xB0) (R/W 32) Receive FIFO 1 Configuration Register -------- */
#define MCAN_RXF1C_F1SA_Pos                   _UINT32_(2)                                          /* (MCAN_RXF1C) Receive FIFO 1 Start Address Position */
#define MCAN_RXF1C_F1SA_Msk                   (_UINT32_(0x3FFF) << MCAN_RXF1C_F1SA_Pos)            /* (MCAN_RXF1C) Receive FIFO 1 Start Address Mask */
#define MCAN_RXF1C_F1SA(value)                (MCAN_RXF1C_F1SA_Msk & (_UINT32_(value) << MCAN_RXF1C_F1SA_Pos)) /* Assigment of value for F1SA in the MCAN_RXF1C register */
#define MCAN_RXF1C_F1S_Pos                    _UINT32_(16)                                         /* (MCAN_RXF1C) Receive FIFO 1 Start Address Position */
#define MCAN_RXF1C_F1S_Msk                    (_UINT32_(0x7F) << MCAN_RXF1C_F1S_Pos)               /* (MCAN_RXF1C) Receive FIFO 1 Start Address Mask */
#define MCAN_RXF1C_F1S(value)                 (MCAN_RXF1C_F1S_Msk & (_UINT32_(value) << MCAN_RXF1C_F1S_Pos)) /* Assigment of value for F1S in the MCAN_RXF1C register */
#define MCAN_RXF1C_F1WM_Pos                   _UINT32_(24)                                         /* (MCAN_RXF1C) Receive FIFO 1 Watermark Position */
#define MCAN_RXF1C_F1WM_Msk                   (_UINT32_(0x7F) << MCAN_RXF1C_F1WM_Pos)              /* (MCAN_RXF1C) Receive FIFO 1 Watermark Mask */
#define MCAN_RXF1C_F1WM(value)                (MCAN_RXF1C_F1WM_Msk & (_UINT32_(value) << MCAN_RXF1C_F1WM_Pos)) /* Assigment of value for F1WM in the MCAN_RXF1C register */
#define MCAN_RXF1C_F1OM_Pos                   _UINT32_(31)                                         /* (MCAN_RXF1C) FIFO 1 Operation Mode Position */
#define MCAN_RXF1C_F1OM_Msk                   (_UINT32_(0x1) << MCAN_RXF1C_F1OM_Pos)               /* (MCAN_RXF1C) FIFO 1 Operation Mode Mask */
#define MCAN_RXF1C_F1OM(value)                (MCAN_RXF1C_F1OM_Msk & (_UINT32_(value) << MCAN_RXF1C_F1OM_Pos)) /* Assigment of value for F1OM in the MCAN_RXF1C register */
#define MCAN_RXF1C_Msk                        _UINT32_(0xFF7FFFFC)                                 /* (MCAN_RXF1C) Register Mask  */


/* -------- MCAN_RXF1S : (MCAN Offset: 0xB4) ( R/ 32) Receive FIFO 1 Status Register -------- */
#define MCAN_RXF1S_F1FL_Pos                   _UINT32_(0)                                          /* (MCAN_RXF1S) Receive FIFO 1 Fill Level Position */
#define MCAN_RXF1S_F1FL_Msk                   (_UINT32_(0x7F) << MCAN_RXF1S_F1FL_Pos)              /* (MCAN_RXF1S) Receive FIFO 1 Fill Level Mask */
#define MCAN_RXF1S_F1FL(value)                (MCAN_RXF1S_F1FL_Msk & (_UINT32_(value) << MCAN_RXF1S_F1FL_Pos)) /* Assigment of value for F1FL in the MCAN_RXF1S register */
#define MCAN_RXF1S_F1GI_Pos                   _UINT32_(8)                                          /* (MCAN_RXF1S) Receive FIFO 1 Get Index Position */
#define MCAN_RXF1S_F1GI_Msk                   (_UINT32_(0x3F) << MCAN_RXF1S_F1GI_Pos)              /* (MCAN_RXF1S) Receive FIFO 1 Get Index Mask */
#define MCAN_RXF1S_F1GI(value)                (MCAN_RXF1S_F1GI_Msk & (_UINT32_(value) << MCAN_RXF1S_F1GI_Pos)) /* Assigment of value for F1GI in the MCAN_RXF1S register */
#define MCAN_RXF1S_F1PI_Pos                   _UINT32_(16)                                         /* (MCAN_RXF1S) Receive FIFO 1 Put Index Position */
#define MCAN_RXF1S_F1PI_Msk                   (_UINT32_(0x3F) << MCAN_RXF1S_F1PI_Pos)              /* (MCAN_RXF1S) Receive FIFO 1 Put Index Mask */
#define MCAN_RXF1S_F1PI(value)                (MCAN_RXF1S_F1PI_Msk & (_UINT32_(value) << MCAN_RXF1S_F1PI_Pos)) /* Assigment of value for F1PI in the MCAN_RXF1S register */
#define MCAN_RXF1S_F1F_Pos                    _UINT32_(24)                                         /* (MCAN_RXF1S) Receive FIFO 1 Fill Level Position */
#define MCAN_RXF1S_F1F_Msk                    (_UINT32_(0x1) << MCAN_RXF1S_F1F_Pos)                /* (MCAN_RXF1S) Receive FIFO 1 Fill Level Mask */
#define MCAN_RXF1S_F1F(value)                 (MCAN_RXF1S_F1F_Msk & (_UINT32_(value) << MCAN_RXF1S_F1F_Pos)) /* Assigment of value for F1F in the MCAN_RXF1S register */
#define MCAN_RXF1S_RF1L_Pos                   _UINT32_(25)                                         /* (MCAN_RXF1S) Receive FIFO 1 Message Lost Position */
#define MCAN_RXF1S_RF1L_Msk                   (_UINT32_(0x1) << MCAN_RXF1S_RF1L_Pos)               /* (MCAN_RXF1S) Receive FIFO 1 Message Lost Mask */
#define MCAN_RXF1S_RF1L(value)                (MCAN_RXF1S_RF1L_Msk & (_UINT32_(value) << MCAN_RXF1S_RF1L_Pos)) /* Assigment of value for RF1L in the MCAN_RXF1S register */
#define MCAN_RXF1S_DMS_Pos                    _UINT32_(30)                                         /* (MCAN_RXF1S) Debug Message Status Position */
#define MCAN_RXF1S_DMS_Msk                    (_UINT32_(0x3) << MCAN_RXF1S_DMS_Pos)                /* (MCAN_RXF1S) Debug Message Status Mask */
#define MCAN_RXF1S_DMS(value)                 (MCAN_RXF1S_DMS_Msk & (_UINT32_(value) << MCAN_RXF1S_DMS_Pos)) /* Assigment of value for DMS in the MCAN_RXF1S register */
#define   MCAN_RXF1S_DMS_IDLE_Val             _UINT32_(0x0)                                        /* (MCAN_RXF1S) Idle state, wait for reception of debug messages, DMA request is cleared.  */
#define   MCAN_RXF1S_DMS_MSG_A_Val            _UINT32_(0x1)                                        /* (MCAN_RXF1S) Debug message A received.  */
#define   MCAN_RXF1S_DMS_MSG_AB_Val           _UINT32_(0x2)                                        /* (MCAN_RXF1S) Debug messages A, B received.  */
#define   MCAN_RXF1S_DMS_MSG_ABC_Val          _UINT32_(0x3)                                        /* (MCAN_RXF1S) Debug messages A, B, C received, DMA request is set.  */
#define MCAN_RXF1S_DMS_IDLE                   (MCAN_RXF1S_DMS_IDLE_Val << MCAN_RXF1S_DMS_Pos)      /* (MCAN_RXF1S) Idle state, wait for reception of debug messages, DMA request is cleared. Position  */
#define MCAN_RXF1S_DMS_MSG_A                  (MCAN_RXF1S_DMS_MSG_A_Val << MCAN_RXF1S_DMS_Pos)     /* (MCAN_RXF1S) Debug message A received. Position  */
#define MCAN_RXF1S_DMS_MSG_AB                 (MCAN_RXF1S_DMS_MSG_AB_Val << MCAN_RXF1S_DMS_Pos)    /* (MCAN_RXF1S) Debug messages A, B received. Position  */
#define MCAN_RXF1S_DMS_MSG_ABC                (MCAN_RXF1S_DMS_MSG_ABC_Val << MCAN_RXF1S_DMS_Pos)   /* (MCAN_RXF1S) Debug messages A, B, C received, DMA request is set. Position  */
#define MCAN_RXF1S_Msk                        _UINT32_(0xC33F3F7F)                                 /* (MCAN_RXF1S) Register Mask  */


/* -------- MCAN_RXF1A : (MCAN Offset: 0xB8) (R/W 32) Receive FIFO 1 Acknowledge Register -------- */
#define MCAN_RXF1A_F1AI_Pos                   _UINT32_(0)                                          /* (MCAN_RXF1A) Receive FIFO 1 Acknowledge Index Position */
#define MCAN_RXF1A_F1AI_Msk                   (_UINT32_(0x3F) << MCAN_RXF1A_F1AI_Pos)              /* (MCAN_RXF1A) Receive FIFO 1 Acknowledge Index Mask */
#define MCAN_RXF1A_F1AI(value)                (MCAN_RXF1A_F1AI_Msk & (_UINT32_(value) << MCAN_RXF1A_F1AI_Pos)) /* Assigment of value for F1AI in the MCAN_RXF1A register */
#define MCAN_RXF1A_Msk                        _UINT32_(0x0000003F)                                 /* (MCAN_RXF1A) Register Mask  */


/* -------- MCAN_RXESC : (MCAN Offset: 0xBC) (R/W 32) Receive Buffer / FIFO Element Size Configuration Register -------- */
#define MCAN_RXESC_F0DS_Pos                   _UINT32_(0)                                          /* (MCAN_RXESC) Receive FIFO 0 Data Field Size Position */
#define MCAN_RXESC_F0DS_Msk                   (_UINT32_(0x7) << MCAN_RXESC_F0DS_Pos)               /* (MCAN_RXESC) Receive FIFO 0 Data Field Size Mask */
#define MCAN_RXESC_F0DS(value)                (MCAN_RXESC_F0DS_Msk & (_UINT32_(value) << MCAN_RXESC_F0DS_Pos)) /* Assigment of value for F0DS in the MCAN_RXESC register */
#define   MCAN_RXESC_F0DS_8_BYTE_Val          _UINT32_(0x0)                                        /* (MCAN_RXESC) 8-byte data field  */
#define   MCAN_RXESC_F0DS_12_BYTE_Val         _UINT32_(0x1)                                        /* (MCAN_RXESC) 12-byte data field  */
#define   MCAN_RXESC_F0DS_16_BYTE_Val         _UINT32_(0x2)                                        /* (MCAN_RXESC) 16-byte data field  */
#define   MCAN_RXESC_F0DS_20_BYTE_Val         _UINT32_(0x3)                                        /* (MCAN_RXESC) 20-byte data field  */
#define   MCAN_RXESC_F0DS_24_BYTE_Val         _UINT32_(0x4)                                        /* (MCAN_RXESC) 24-byte data field  */
#define   MCAN_RXESC_F0DS_32_BYTE_Val         _UINT32_(0x5)                                        /* (MCAN_RXESC) 32-byte data field  */
#define   MCAN_RXESC_F0DS_48_BYTE_Val         _UINT32_(0x6)                                        /* (MCAN_RXESC) 48-byte data field  */
#define   MCAN_RXESC_F0DS_64_BYTE_Val         _UINT32_(0x7)                                        /* (MCAN_RXESC) 64-byte data field  */
#define MCAN_RXESC_F0DS_8_BYTE                (MCAN_RXESC_F0DS_8_BYTE_Val << MCAN_RXESC_F0DS_Pos)  /* (MCAN_RXESC) 8-byte data field Position  */
#define MCAN_RXESC_F0DS_12_BYTE               (MCAN_RXESC_F0DS_12_BYTE_Val << MCAN_RXESC_F0DS_Pos) /* (MCAN_RXESC) 12-byte data field Position  */
#define MCAN_RXESC_F0DS_16_BYTE               (MCAN_RXESC_F0DS_16_BYTE_Val << MCAN_RXESC_F0DS_Pos) /* (MCAN_RXESC) 16-byte data field Position  */
#define MCAN_RXESC_F0DS_20_BYTE               (MCAN_RXESC_F0DS_20_BYTE_Val << MCAN_RXESC_F0DS_Pos) /* (MCAN_RXESC) 20-byte data field Position  */
#define MCAN_RXESC_F0DS_24_BYTE               (MCAN_RXESC_F0DS_24_BYTE_Val << MCAN_RXESC_F0DS_Pos) /* (MCAN_RXESC) 24-byte data field Position  */
#define MCAN_RXESC_F0DS_32_BYTE               (MCAN_RXESC_F0DS_32_BYTE_Val << MCAN_RXESC_F0DS_Pos) /* (MCAN_RXESC) 32-byte data field Position  */
#define MCAN_RXESC_F0DS_48_BYTE               (MCAN_RXESC_F0DS_48_BYTE_Val << MCAN_RXESC_F0DS_Pos) /* (MCAN_RXESC) 48-byte data field Position  */
#define MCAN_RXESC_F0DS_64_BYTE               (MCAN_RXESC_F0DS_64_BYTE_Val << MCAN_RXESC_F0DS_Pos) /* (MCAN_RXESC) 64-byte data field Position  */
#define MCAN_RXESC_F1DS_Pos                   _UINT32_(4)                                          /* (MCAN_RXESC) Receive FIFO 1 Data Field Size Position */
#define MCAN_RXESC_F1DS_Msk                   (_UINT32_(0x7) << MCAN_RXESC_F1DS_Pos)               /* (MCAN_RXESC) Receive FIFO 1 Data Field Size Mask */
#define MCAN_RXESC_F1DS(value)                (MCAN_RXESC_F1DS_Msk & (_UINT32_(value) << MCAN_RXESC_F1DS_Pos)) /* Assigment of value for F1DS in the MCAN_RXESC register */
#define   MCAN_RXESC_F1DS_8_BYTE_Val          _UINT32_(0x0)                                        /* (MCAN_RXESC) 8-byte data field  */
#define   MCAN_RXESC_F1DS_12_BYTE_Val         _UINT32_(0x1)                                        /* (MCAN_RXESC) 12-byte data field  */
#define   MCAN_RXESC_F1DS_16_BYTE_Val         _UINT32_(0x2)                                        /* (MCAN_RXESC) 16-byte data field  */
#define   MCAN_RXESC_F1DS_20_BYTE_Val         _UINT32_(0x3)                                        /* (MCAN_RXESC) 20-byte data field  */
#define   MCAN_RXESC_F1DS_24_BYTE_Val         _UINT32_(0x4)                                        /* (MCAN_RXESC) 24-byte data field  */
#define   MCAN_RXESC_F1DS_32_BYTE_Val         _UINT32_(0x5)                                        /* (MCAN_RXESC) 32-byte data field  */
#define   MCAN_RXESC_F1DS_48_BYTE_Val         _UINT32_(0x6)                                        /* (MCAN_RXESC) 48-byte data field  */
#define   MCAN_RXESC_F1DS_64_BYTE_Val         _UINT32_(0x7)                                        /* (MCAN_RXESC) 64-byte data field  */
#define MCAN_RXESC_F1DS_8_BYTE                (MCAN_RXESC_F1DS_8_BYTE_Val << MCAN_RXESC_F1DS_Pos)  /* (MCAN_RXESC) 8-byte data field Position  */
#define MCAN_RXESC_F1DS_12_BYTE               (MCAN_RXESC_F1DS_12_BYTE_Val << MCAN_RXESC_F1DS_Pos) /* (MCAN_RXESC) 12-byte data field Position  */
#define MCAN_RXESC_F1DS_16_BYTE               (MCAN_RXESC_F1DS_16_BYTE_Val << MCAN_RXESC_F1DS_Pos) /* (MCAN_RXESC) 16-byte data field Position  */
#define MCAN_RXESC_F1DS_20_BYTE               (MCAN_RXESC_F1DS_20_BYTE_Val << MCAN_RXESC_F1DS_Pos) /* (MCAN_RXESC) 20-byte data field Position  */
#define MCAN_RXESC_F1DS_24_BYTE               (MCAN_RXESC_F1DS_24_BYTE_Val << MCAN_RXESC_F1DS_Pos) /* (MCAN_RXESC) 24-byte data field Position  */
#define MCAN_RXESC_F1DS_32_BYTE               (MCAN_RXESC_F1DS_32_BYTE_Val << MCAN_RXESC_F1DS_Pos) /* (MCAN_RXESC) 32-byte data field Position  */
#define MCAN_RXESC_F1DS_48_BYTE               (MCAN_RXESC_F1DS_48_BYTE_Val << MCAN_RXESC_F1DS_Pos) /* (MCAN_RXESC) 48-byte data field Position  */
#define MCAN_RXESC_F1DS_64_BYTE               (MCAN_RXESC_F1DS_64_BYTE_Val << MCAN_RXESC_F1DS_Pos) /* (MCAN_RXESC) 64-byte data field Position  */
#define MCAN_RXESC_RBDS_Pos                   _UINT32_(8)                                          /* (MCAN_RXESC) Receive Buffer Data Field Size Position */
#define MCAN_RXESC_RBDS_Msk                   (_UINT32_(0x7) << MCAN_RXESC_RBDS_Pos)               /* (MCAN_RXESC) Receive Buffer Data Field Size Mask */
#define MCAN_RXESC_RBDS(value)                (MCAN_RXESC_RBDS_Msk & (_UINT32_(value) << MCAN_RXESC_RBDS_Pos)) /* Assigment of value for RBDS in the MCAN_RXESC register */
#define   MCAN_RXESC_RBDS_8_BYTE_Val          _UINT32_(0x0)                                        /* (MCAN_RXESC) 8-byte data field  */
#define   MCAN_RXESC_RBDS_12_BYTE_Val         _UINT32_(0x1)                                        /* (MCAN_RXESC) 12-byte data field  */
#define   MCAN_RXESC_RBDS_16_BYTE_Val         _UINT32_(0x2)                                        /* (MCAN_RXESC) 16-byte data field  */
#define   MCAN_RXESC_RBDS_20_BYTE_Val         _UINT32_(0x3)                                        /* (MCAN_RXESC) 20-byte data field  */
#define   MCAN_RXESC_RBDS_24_BYTE_Val         _UINT32_(0x4)                                        /* (MCAN_RXESC) 24-byte data field  */
#define   MCAN_RXESC_RBDS_32_BYTE_Val         _UINT32_(0x5)                                        /* (MCAN_RXESC) 32-byte data field  */
#define   MCAN_RXESC_RBDS_48_BYTE_Val         _UINT32_(0x6)                                        /* (MCAN_RXESC) 48-byte data field  */
#define   MCAN_RXESC_RBDS_64_BYTE_Val         _UINT32_(0x7)                                        /* (MCAN_RXESC) 64-byte data field  */
#define MCAN_RXESC_RBDS_8_BYTE                (MCAN_RXESC_RBDS_8_BYTE_Val << MCAN_RXESC_RBDS_Pos)  /* (MCAN_RXESC) 8-byte data field Position  */
#define MCAN_RXESC_RBDS_12_BYTE               (MCAN_RXESC_RBDS_12_BYTE_Val << MCAN_RXESC_RBDS_Pos) /* (MCAN_RXESC) 12-byte data field Position  */
#define MCAN_RXESC_RBDS_16_BYTE               (MCAN_RXESC_RBDS_16_BYTE_Val << MCAN_RXESC_RBDS_Pos) /* (MCAN_RXESC) 16-byte data field Position  */
#define MCAN_RXESC_RBDS_20_BYTE               (MCAN_RXESC_RBDS_20_BYTE_Val << MCAN_RXESC_RBDS_Pos) /* (MCAN_RXESC) 20-byte data field Position  */
#define MCAN_RXESC_RBDS_24_BYTE               (MCAN_RXESC_RBDS_24_BYTE_Val << MCAN_RXESC_RBDS_Pos) /* (MCAN_RXESC) 24-byte data field Position  */
#define MCAN_RXESC_RBDS_32_BYTE               (MCAN_RXESC_RBDS_32_BYTE_Val << MCAN_RXESC_RBDS_Pos) /* (MCAN_RXESC) 32-byte data field Position  */
#define MCAN_RXESC_RBDS_48_BYTE               (MCAN_RXESC_RBDS_48_BYTE_Val << MCAN_RXESC_RBDS_Pos) /* (MCAN_RXESC) 48-byte data field Position  */
#define MCAN_RXESC_RBDS_64_BYTE               (MCAN_RXESC_RBDS_64_BYTE_Val << MCAN_RXESC_RBDS_Pos) /* (MCAN_RXESC) 64-byte data field Position  */
#define MCAN_RXESC_Msk                        _UINT32_(0x00000777)                                 /* (MCAN_RXESC) Register Mask  */


/* -------- MCAN_TXBC : (MCAN Offset: 0xC0) (R/W 32) Transmit Buffer Configuration Register -------- */
#define MCAN_TXBC_TBSA_Pos                    _UINT32_(2)                                          /* (MCAN_TXBC) Tx Buffers Start Address Position */
#define MCAN_TXBC_TBSA_Msk                    (_UINT32_(0x3FFF) << MCAN_TXBC_TBSA_Pos)             /* (MCAN_TXBC) Tx Buffers Start Address Mask */
#define MCAN_TXBC_TBSA(value)                 (MCAN_TXBC_TBSA_Msk & (_UINT32_(value) << MCAN_TXBC_TBSA_Pos)) /* Assigment of value for TBSA in the MCAN_TXBC register */
#define MCAN_TXBC_NDTB_Pos                    _UINT32_(16)                                         /* (MCAN_TXBC) Number of Dedicated Transmit Buffers Position */
#define MCAN_TXBC_NDTB_Msk                    (_UINT32_(0x3F) << MCAN_TXBC_NDTB_Pos)               /* (MCAN_TXBC) Number of Dedicated Transmit Buffers Mask */
#define MCAN_TXBC_NDTB(value)                 (MCAN_TXBC_NDTB_Msk & (_UINT32_(value) << MCAN_TXBC_NDTB_Pos)) /* Assigment of value for NDTB in the MCAN_TXBC register */
#define MCAN_TXBC_TFQS_Pos                    _UINT32_(24)                                         /* (MCAN_TXBC) Transmit FIFO/Queue Size Position */
#define MCAN_TXBC_TFQS_Msk                    (_UINT32_(0x3F) << MCAN_TXBC_TFQS_Pos)               /* (MCAN_TXBC) Transmit FIFO/Queue Size Mask */
#define MCAN_TXBC_TFQS(value)                 (MCAN_TXBC_TFQS_Msk & (_UINT32_(value) << MCAN_TXBC_TFQS_Pos)) /* Assigment of value for TFQS in the MCAN_TXBC register */
#define MCAN_TXBC_TFQM_Pos                    _UINT32_(30)                                         /* (MCAN_TXBC) Tx FIFO/Queue Mode Position */
#define MCAN_TXBC_TFQM_Msk                    (_UINT32_(0x1) << MCAN_TXBC_TFQM_Pos)                /* (MCAN_TXBC) Tx FIFO/Queue Mode Mask */
#define MCAN_TXBC_TFQM(value)                 (MCAN_TXBC_TFQM_Msk & (_UINT32_(value) << MCAN_TXBC_TFQM_Pos)) /* Assigment of value for TFQM in the MCAN_TXBC register */
#define MCAN_TXBC_Msk                         _UINT32_(0x7F3FFFFC)                                 /* (MCAN_TXBC) Register Mask  */


