Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/firmware/src/packs/PIC32CZ2051CA70144_DFP/component/mcan.h
/* -------- MCAN_TXFQS : (MCAN Offset: 0xC4) ( R/ 32) Transmit FIFO/Queue Status Register -------- */
#define MCAN_TXFQS_TFFL_Pos                   _UINT32_(0)                                          /* (MCAN_TXFQS) Tx FIFO Free Level Position */
#define MCAN_TXFQS_TFFL_Msk                   (_UINT32_(0x3F) << MCAN_TXFQS_TFFL_Pos)              /* (MCAN_TXFQS) Tx FIFO Free Level Mask */
#define MCAN_TXFQS_TFFL(value)                (MCAN_TXFQS_TFFL_Msk & (_UINT32_(value) << MCAN_TXFQS_TFFL_Pos)) /* Assigment of value for TFFL in the MCAN_TXFQS register */
#define MCAN_TXFQS_TFGI_Pos                   _UINT32_(8)                                          /* (MCAN_TXFQS) Tx FIFO Get Index Position */
#define MCAN_TXFQS_TFGI_Msk                   (_UINT32_(0x1F) << MCAN_TXFQS_TFGI_Pos)              /* (MCAN_TXFQS) Tx FIFO Get Index Mask */
#define MCAN_TXFQS_TFGI(value)                (MCAN_TXFQS_TFGI_Msk & (_UINT32_(value) << MCAN_TXFQS_TFGI_Pos)) /* Assigment of value for TFGI in the MCAN_TXFQS register */
#define MCAN_TXFQS_TFQPI_Pos                  _UINT32_(16)                                         /* (MCAN_TXFQS) Tx FIFO/Queue Put Index Position */
#define MCAN_TXFQS_TFQPI_Msk                  (_UINT32_(0x1F) << MCAN_TXFQS_TFQPI_Pos)             /* (MCAN_TXFQS) Tx FIFO/Queue Put Index Mask */
#define MCAN_TXFQS_TFQPI(value)               (MCAN_TXFQS_TFQPI_Msk & (_UINT32_(value) << MCAN_TXFQS_TFQPI_Pos)) /* Assigment of value for TFQPI in the MCAN_TXFQS register */
#define MCAN_TXFQS_TFQF_Pos                   _UINT32_(21)                                         /* (MCAN_TXFQS) Tx FIFO/Queue Full Position */
#define MCAN_TXFQS_TFQF_Msk                   (_UINT32_(0x1) << MCAN_TXFQS_TFQF_Pos)               /* (MCAN_TXFQS) Tx FIFO/Queue Full Mask */
#define MCAN_TXFQS_TFQF(value)                (MCAN_TXFQS_TFQF_Msk & (_UINT32_(value) << MCAN_TXFQS_TFQF_Pos)) /* Assigment of value for TFQF in the MCAN_TXFQS register */
#define MCAN_TXFQS_Msk                        _UINT32_(0x003F1F3F)                                 /* (MCAN_TXFQS) Register Mask  */


/* -------- MCAN_TXESC : (MCAN Offset: 0xC8) (R/W 32) Transmit Buffer Element Size Configuration Register -------- */
#define MCAN_TXESC_TBDS_Pos                   _UINT32_(0)                                          /* (MCAN_TXESC) Tx Buffer Data Field Size Position */
#define MCAN_TXESC_TBDS_Msk                   (_UINT32_(0x7) << MCAN_TXESC_TBDS_Pos)               /* (MCAN_TXESC) Tx Buffer Data Field Size Mask */
#define MCAN_TXESC_TBDS(value)                (MCAN_TXESC_TBDS_Msk & (_UINT32_(value) << MCAN_TXESC_TBDS_Pos)) /* Assigment of value for TBDS in the MCAN_TXESC register */
#define   MCAN_TXESC_TBDS_8_BYTE_Val          _UINT32_(0x0)                                        /* (MCAN_TXESC) 8-byte data field  */
#define   MCAN_TXESC_TBDS_12_BYTE_Val         _UINT32_(0x1)                                        /* (MCAN_TXESC) 12-byte data field  */
#define   MCAN_TXESC_TBDS_16_BYTE_Val         _UINT32_(0x2)                                        /* (MCAN_TXESC) 16-byte data field  */
#define   MCAN_TXESC_TBDS_20_BYTE_Val         _UINT32_(0x3)                                        /* (MCAN_TXESC) 20-byte data field  */
#define   MCAN_TXESC_TBDS_24_BYTE_Val         _UINT32_(0x4)                                        /* (MCAN_TXESC) 24-byte data field  */
#define   MCAN_TXESC_TBDS_32_BYTE_Val         _UINT32_(0x5)                                        /* (MCAN_TXESC) 32-byte data field  */
#define   MCAN_TXESC_TBDS_48_BYTE_Val         _UINT32_(0x6)                                        /* (MCAN_TXESC) 48-byte data field  */
#define   MCAN_TXESC_TBDS_64_BYTE_Val         _UINT32_(0x7)                                        /* (MCAN_TXESC) 64-byte data field  */
#define MCAN_TXESC_TBDS_8_BYTE                (MCAN_TXESC_TBDS_8_BYTE_Val << MCAN_TXESC_TBDS_Pos)  /* (MCAN_TXESC) 8-byte data field Position  */
#define MCAN_TXESC_TBDS_12_BYTE               (MCAN_TXESC_TBDS_12_BYTE_Val << MCAN_TXESC_TBDS_Pos) /* (MCAN_TXESC) 12-byte data field Position  */
#define MCAN_TXESC_TBDS_16_BYTE               (MCAN_TXESC_TBDS_16_BYTE_Val << MCAN_TXESC_TBDS_Pos) /* (MCAN_TXESC) 16-byte data field Position  */
#define MCAN_TXESC_TBDS_20_BYTE               (MCAN_TXESC_TBDS_20_BYTE_Val << MCAN_TXESC_TBDS_Pos) /* (MCAN_TXESC) 20-byte data field Position  */
#define MCAN_TXESC_TBDS_24_BYTE               (MCAN_TXESC_TBDS_24_BYTE_Val << MCAN_TXESC_TBDS_Pos) /* (MCAN_TXESC) 24-byte data field Position  */
#define MCAN_TXESC_TBDS_32_BYTE               (MCAN_TXESC_TBDS_32_BYTE_Val << MCAN_TXESC_TBDS_Pos) /* (MCAN_TXESC) 32-byte data field Position  */
#define MCAN_TXESC_TBDS_48_BYTE               (MCAN_TXESC_TBDS_48_BYTE_Val << MCAN_TXESC_TBDS_Pos) /* (MCAN_TXESC) 48-byte data field Position  */
#define MCAN_TXESC_TBDS_64_BYTE               (MCAN_TXESC_TBDS_64_BYTE_Val << MCAN_TXESC_TBDS_Pos) /* (MCAN_TXESC) 64-byte data field Position  */
#define MCAN_TXESC_Msk                        _UINT32_(0x00000007)                                 /* (MCAN_TXESC) Register Mask  */


/* -------- MCAN_TXBRP : (MCAN Offset: 0xCC) ( R/ 32) Transmit Buffer Request Pending Register -------- */
#define MCAN_TXBRP_TRP0_Pos                   _UINT32_(0)                                          /* (MCAN_TXBRP) Transmission Request Pending for Buffer 0 Position */
#define MCAN_TXBRP_TRP0_Msk                   (_UINT32_(0x1) << MCAN_TXBRP_TRP0_Pos)               /* (MCAN_TXBRP) Transmission Request Pending for Buffer 0 Mask */
#define MCAN_TXBRP_TRP0(value)                (MCAN_TXBRP_TRP0_Msk & (_UINT32_(value) << MCAN_TXBRP_TRP0_Pos)) /* Assigment of value for TRP0 in the MCAN_TXBRP register */
#define MCAN_TXBRP_TRP1_Pos                   _UINT32_(1)                                          /* (MCAN_TXBRP) Transmission Request Pending for Buffer 1 Position */
#define MCAN_TXBRP_TRP1_Msk                   (_UINT32_(0x1) << MCAN_TXBRP_TRP1_Pos)               /* (MCAN_TXBRP) Transmission Request Pending for Buffer 1 Mask */
#define MCAN_TXBRP_TRP1(value)                (MCAN_TXBRP_TRP1_Msk & (_UINT32_(value) << MCAN_TXBRP_TRP1_Pos)) /* Assigment of value for TRP1 in the MCAN_TXBRP register */
#define MCAN_TXBRP_TRP2_Pos                   _UINT32_(2)                                          /* (MCAN_TXBRP) Transmission Request Pending for Buffer 2 Position */
#define MCAN_TXBRP_TRP2_Msk                   (_UINT32_(0x1) << MCAN_TXBRP_TRP2_Pos)               /* (MCAN_TXBRP) Transmission Request Pending for Buffer 2 Mask */
#define MCAN_TXBRP_TRP2(value)                (MCAN_TXBRP_TRP2_Msk & (_UINT32_(value) << MCAN_TXBRP_TRP2_Pos)) /* Assigment of value for TRP2 in the MCAN_TXBRP register */
#define MCAN_TXBRP_TRP3_Pos                   _UINT32_(3)                                          /* (MCAN_TXBRP) Transmission Request Pending for Buffer 3 Position */
#define MCAN_TXBRP_TRP3_Msk                   (_UINT32_(0x1) << MCAN_TXBRP_TRP3_Pos)               /* (MCAN_TXBRP) Transmission Request Pending for Buffer 3 Mask */
#define MCAN_TXBRP_TRP3(value)                (MCAN_TXBRP_TRP3_Msk & (_UINT32_(value) << MCAN_TXBRP_TRP3_Pos)) /* Assigment of value for TRP3 in the MCAN_TXBRP register */
#define MCAN_TXBRP_TRP4_Pos                   _UINT32_(4)                                          /* (MCAN_TXBRP) Transmission Request Pending for Buffer 4 Position */
#define MCAN_TXBRP_TRP4_Msk                   (_UINT32_(0x1) << MCAN_TXBRP_TRP4_Pos)               /* (MCAN_TXBRP) Transmission Request Pending for Buffer 4 Mask */
#define MCAN_TXBRP_TRP4(value)                (MCAN_TXBRP_TRP4_Msk & (_UINT32_(value) << MCAN_TXBRP_TRP4_Pos)) /* Assigment of value for TRP4 in the MCAN_TXBRP register */
#define MCAN_TXBRP_TRP5_Pos                   _UINT32_(5)                                          /* (MCAN_TXBRP) Transmission Request Pending for Buffer 5 Position */
#define MCAN_TXBRP_TRP5_Msk                   (_UINT32_(0x1) << MCAN_TXBRP_TRP5_Pos)               /* (MCAN_TXBRP) Transmission Request Pending for Buffer 5 Mask */
#define MCAN_TXBRP_TRP5(value)                (MCAN_TXBRP_TRP5_Msk & (_UINT32_(value) << MCAN_TXBRP_TRP5_Pos)) /* Assigment of value for TRP5 in the MCAN_TXBRP register */
#define MCAN_TXBRP_TRP6_Pos                   _UINT32_(6)                                          /* (MCAN_TXBRP) Transmission Request Pending for Buffer 6 Position */
#define MCAN_TXBRP_TRP6_Msk                   (_UINT32_(0x1) << MCAN_TXBRP_TRP6_Pos)               /* (MCAN_TXBRP) Transmission Request Pending for Buffer 6 Mask */
#define MCAN_TXBRP_TRP6(value)                (MCAN_TXBRP_TRP6_Msk & (_UINT32_(value) << MCAN_TXBRP_TRP6_Pos)) /* Assigment of value for TRP6 in the MCAN_TXBRP register */
#define MCAN_TXBRP_TRP7_Pos                   _UINT32_(7)                                          /* (MCAN_TXBRP) Transmission Request Pending for Buffer 7 Position */
#define MCAN_TXBRP_TRP7_Msk                   (_UINT32_(0x1) << MCAN_TXBRP_TRP7_Pos)               /* (MCAN_TXBRP) Transmission Request Pending for Buffer 7 Mask */
#define MCAN_TXBRP_TRP7(value)                (MCAN_TXBRP_TRP7_Msk & (_UINT32_(value) << MCAN_TXBRP_TRP7_Pos)) /* Assigment of value for TRP7 in the MCAN_TXBRP register */
#define MCAN_TXBRP_TRP8_Pos                   _UINT32_(8)                                          /* (MCAN_TXBRP) Transmission Request Pending for Buffer 8 Position */
#define MCAN_TXBRP_TRP8_Msk                   (_UINT32_(0x1) << MCAN_TXBRP_TRP8_Pos)               /* (MCAN_TXBRP) Transmission Request Pending for Buffer 8 Mask */
#define MCAN_TXBRP_TRP8(value)                (MCAN_TXBRP_TRP8_Msk & (_UINT32_(value) << MCAN_TXBRP_TRP8_Pos)) /* Assigment of value for TRP8 in the MCAN_TXBRP register */
#define MCAN_TXBRP_TRP9_Pos                   _UINT32_(9)                                          /* (MCAN_TXBRP) Transmission Request Pending for Buffer 9 Position */
#define MCAN_TXBRP_TRP9_Msk                   (_UINT32_(0x1) << MCAN_TXBRP_TRP9_Pos)               /* (MCAN_TXBRP) Transmission Request Pending for Buffer 9 Mask */
#define MCAN_TXBRP_TRP9(value)                (MCAN_TXBRP_TRP9_Msk & (_UINT32_(value) << MCAN_TXBRP_TRP9_Pos)) /* Assigment of value for TRP9 in the MCAN_TXBRP register */
#define MCAN_TXBRP_TRP10_Pos                  _UINT32_(10)                                         /* (MCAN_TXBRP) Transmission Request Pending for Buffer 10 Position */
#define MCAN_TXBRP_TRP10_Msk                  (_UINT32_(0x1) << MCAN_TXBRP_TRP10_Pos)              /* (MCAN_TXBRP) Transmission Request Pending for Buffer 10 Mask */
#define MCAN_TXBRP_TRP10(value)               (MCAN_TXBRP_TRP10_Msk & (_UINT32_(value) << MCAN_TXBRP_TRP10_Pos)) /* Assigment of value for TRP10 in the MCAN_TXBRP register */
#define MCAN_TXBRP_TRP11_Pos                  _UINT32_(11)                                         /* (MCAN_TXBRP) Transmission Request Pending for Buffer 11 Position */
#define MCAN_TXBRP_TRP11_Msk                  (_UINT32_(0x1) << MCAN_TXBRP_TRP11_Pos)              /* (MCAN_TXBRP) Transmission Request Pending for Buffer 11 Mask */
#define MCAN_TXBRP_TRP11(value)               (MCAN_TXBRP_TRP11_Msk & (_UINT32_(value) << MCAN_TXBRP_TRP11_Pos)) /* Assigment of value for TRP11 in the MCAN_TXBRP register */
#define MCAN_TXBRP_TRP12_Pos                  _UINT32_(12)                                         /* (MCAN_TXBRP) Transmission Request Pending for Buffer 12 Position */
#define MCAN_TXBRP_TRP12_Msk                  (_UINT32_(0x1) << MCAN_TXBRP_TRP12_Pos)              /* (MCAN_TXBRP) Transmission Request Pending for Buffer 12 Mask */
#define MCAN_TXBRP_TRP12(value)               (MCAN_TXBRP_TRP12_Msk & (_UINT32_(value) << MCAN_TXBRP_TRP12_Pos)) /* Assigment of value for TRP12 in the MCAN_TXBRP register */
#define MCAN_TXBRP_TRP13_Pos                  _UINT32_(13)                                         /* (MCAN_TXBRP) Transmission Request Pending for Buffer 13 Position */
#define MCAN_TXBRP_TRP13_Msk                  (_UINT32_(0x1) << MCAN_TXBRP_TRP13_Pos)              /* (MCAN_TXBRP) Transmission Request Pending for Buffer 13 Mask */
#define MCAN_TXBRP_TRP13(value)               (MCAN_TXBRP_TRP13_Msk & (_UINT32_(value) << MCAN_TXBRP_TRP13_Pos)) /* Assigment of value for TRP13 in the MCAN_TXBRP register */
#define MCAN_TXBRP_TRP14_Pos                  _UINT32_(14)                                         /* (MCAN_TXBRP) Transmission Request Pending for Buffer 14 Position */
#define MCAN_TXBRP_TRP14_Msk                  (_UINT32_(0x1) << MCAN_TXBRP_TRP14_Pos)              /* (MCAN_TXBRP) Transmission Request Pending for Buffer 14 Mask */
#define MCAN_TXBRP_TRP14(value)               (MCAN_TXBRP_TRP14_Msk & (_UINT32_(value) << MCAN_TXBRP_TRP14_Pos)) /* Assigment of value for TRP14 in the MCAN_TXBRP register */
#define MCAN_TXBRP_TRP15_Pos                  _UINT32_(15)                                         /* (MCAN_TXBRP) Transmission Request Pending for Buffer 15 Position */
#define MCAN_TXBRP_TRP15_Msk                  (_UINT32_(0x1) << MCAN_TXBRP_TRP15_Pos)              /* (MCAN_TXBRP) Transmission Request Pending for Buffer 15 Mask */
#define MCAN_TXBRP_TRP15(value)               (MCAN_TXBRP_TRP15_Msk & (_UINT32_(value) << MCAN_TXBRP_TRP15_Pos)) /* Assigment of value for TRP15 in the MCAN_TXBRP register */
#define MCAN_TXBRP_TRP16_Pos                  _UINT32_(16)                                         /* (MCAN_TXBRP) Transmission Request Pending for Buffer 16 Position */
#define MCAN_TXBRP_TRP16_Msk                  (_UINT32_(0x1) << MCAN_TXBRP_TRP16_Pos)              /* (MCAN_TXBRP) Transmission Request Pending for Buffer 16 Mask */
#define MCAN_TXBRP_TRP16(value)               (MCAN_TXBRP_TRP16_Msk & (_UINT32_(value) << MCAN_TXBRP_TRP16_Pos)) /* Assigment of value for TRP16 in the MCAN_TXBRP register */
#define MCAN_TXBRP_TRP17_Pos                  _UINT32_(17)                                         /* (MCAN_TXBRP) Transmission Request Pending for Buffer 17 Position */
#define MCAN_TXBRP_TRP17_Msk                  (_UINT32_(0x1) << MCAN_TXBRP_TRP17_Pos)              /* (MCAN_TXBRP) Transmission Request Pending for Buffer 17 Mask */
#define MCAN_TXBRP_TRP17(value)               (MCAN_TXBRP_TRP17_Msk & (_UINT32_(value) << MCAN_TXBRP_TRP17_Pos)) /* Assigment of value for TRP17 in the MCAN_TXBRP register */
#define MCAN_TXBRP_TRP18_Pos                  _UINT32_(18)                                         /* (MCAN_TXBRP) Transmission Request Pending for Buffer 18 Position */
#define MCAN_TXBRP_TRP18_Msk                  (_UINT32_(0x1) << MCAN_TXBRP_TRP18_Pos)              /* (MCAN_TXBRP) Transmission Request Pending for Buffer 18 Mask */
#define MCAN_TXBRP_TRP18(value)               (MCAN_TXBRP_TRP18_Msk & (_UINT32_(value) << MCAN_TXBRP_TRP18_Pos)) /* Assigment of value for TRP18 in the MCAN_TXBRP register */
#define MCAN_TXBRP_TRP19_Pos                  _UINT32_(19)                                         /* (MCAN_TXBRP) Transmission Request Pending for Buffer 19 Position */
#define MCAN_TXBRP_TRP19_Msk                  (_UINT32_(0x1) << MCAN_TXBRP_TRP19_Pos)              /* (MCAN_TXBRP) Transmission Request Pending for Buffer 19 Mask */
#define MCAN_TXBRP_TRP19(value)               (MCAN_TXBRP_TRP19_Msk & (_UINT32_(value) << MCAN_TXBRP_TRP19_Pos)) /* Assigment of value for TRP19 in the MCAN_TXBRP register */
#define MCAN_TXBRP_TRP20_Pos                  _UINT32_(20)                                         /* (MCAN_TXBRP) Transmission Request Pending for Buffer 20 Position */
#define MCAN_TXBRP_TRP20_Msk                  (_UINT32_(0x1) << MCAN_TXBRP_TRP20_Pos)              /* (MCAN_TXBRP) Transmission Request Pending for Buffer 20 Mask */
#define MCAN_TXBRP_TRP20(value)               (MCAN_TXBRP_TRP20_Msk & (_UINT32_(value) << MCAN_TXBRP_TRP20_Pos)) /* Assigment of value for TRP20 in the MCAN_TXBRP register */
#define MCAN_TXBRP_TRP21_Pos                  _UINT32_(21)                                         /* (MCAN_TXBRP) Transmission Request Pending for Buffer 21 Position */
#define MCAN_TXBRP_TRP21_Msk                  (_UINT32_(0x1) << MCAN_TXBRP_TRP21_Pos)              /* (MCAN_TXBRP) Transmission Request Pending for Buffer 21 Mask */
#define MCAN_TXBRP_TRP21(value)               (MCAN_TXBRP_TRP21_Msk & (_UINT32_(value) << MCAN_TXBRP_TRP21_Pos)) /* Assigment of value for TRP21 in the MCAN_TXBRP register */
#define MCAN_TXBRP_TRP22_Pos                  _UINT32_(22)                                         /* (MCAN_TXBRP) Transmission Request Pending for Buffer 22 Position */
#define MCAN_TXBRP_TRP22_Msk                  (_UINT32_(0x1) << MCAN_TXBRP_TRP22_Pos)              /* (MCAN_TXBRP) Transmission Request Pending for Buffer 22 Mask */
#define MCAN_TXBRP_TRP22(value)               (MCAN_TXBRP_TRP22_Msk & (_UINT32_(value) << MCAN_TXBRP_TRP22_Pos)) /* Assigment of value for TRP22 in the MCAN_TXBRP register */
#define MCAN_TXBRP_TRP23_Pos                  _UINT32_(23)                                         /* (MCAN_TXBRP) Transmission Request Pending for Buffer 23 Position */
#define MCAN_TXBRP_TRP23_Msk                  (_UINT32_(0x1) << MCAN_TXBRP_TRP23_Pos)              /* (MCAN_TXBRP) Transmission Request Pending for Buffer 23 Mask */
#define MCAN_TXBRP_TRP23(value)               (MCAN_TXBRP_TRP23_Msk & (_UINT32_(value) << MCAN_TXBRP_TRP23_Pos)) /* Assigment of value for TRP23 in the MCAN_TXBRP register */
#define MCAN_TXBRP_TRP24_Pos                  _UINT32_(24)                                         /* (MCAN_TXBRP) Transmission Request Pending for Buffer 24 Position */
#define MCAN_TXBRP_TRP24_Msk                  (_UINT32_(0x1) << MCAN_TXBRP_TRP24_Pos)              /* (MCAN_TXBRP) Transmission Request Pending for Buffer 24 Mask */
#define MCAN_TXBRP_TRP24(value)               (MCAN_TXBRP_TRP24_Msk & (_UINT32_(value) << MCAN_TXBRP_TRP24_Pos)) /* Assigment of value for TRP24 in the MCAN_TXBRP register */
#define MCAN_TXBRP_TRP25_Pos                  _UINT32_(25)                                         /* (MCAN_TXBRP) Transmission Request Pending for Buffer 25 Position */
#define MCAN_TXBRP_TRP25_Msk                  (_UINT32_(0x1) << MCAN_TXBRP_TRP25_Pos)              /* (MCAN_TXBRP) Transmission Request Pending for Buffer 25 Mask */
#define MCAN_TXBRP_TRP25(value)               (MCAN_TXBRP_TRP25_Msk & (_UINT32_(value) << MCAN_TXBRP_TRP25_Pos)) /* Assigment of value for TRP25 in the MCAN_TXBRP register */
#define MCAN_TXBRP_TRP26_Pos                  _UINT32_(26)                                         /* (MCAN_TXBRP) Transmission Request Pending for Buffer 26 Position */
#define MCAN_TXBRP_TRP26_Msk                  (_UINT32_(0x1) << MCAN_TXBRP_TRP26_Pos)              /* (MCAN_TXBRP) Transmission Request Pending for Buffer 26 Mask */
#define MCAN_TXBRP_TRP26(value)               (MCAN_TXBRP_TRP26_Msk & (_UINT32_(value) << MCAN_TXBRP_TRP26_Pos)) /* Assigment of value for TRP26 in the MCAN_TXBRP register */
#define MCAN_TXBRP_TRP27_Pos                  _UINT32_(27)                                         /* (MCAN_TXBRP) Transmission Request Pending for Buffer 27 Position */
#define MCAN_TXBRP_TRP27_Msk                  (_UINT32_(0x1) << MCAN_TXBRP_TRP27_Pos)              /* (MCAN_TXBRP) Transmission Request Pending for Buffer 27 Mask */
#define MCAN_TXBRP_TRP27(value)               (MCAN_TXBRP_TRP27_Msk & (_UINT32_(value) << MCAN_TXBRP_TRP27_Pos)) /* Assigment of value for TRP27 in the MCAN_TXBRP register */
#define MCAN_TXBRP_TRP28_Pos                  _UINT32_(28)                                         /* (MCAN_TXBRP) Transmission Request Pending for Buffer 28 Position */
#define MCAN_TXBRP_TRP28_Msk                  (_UINT32_(0x1) << MCAN_TXBRP_TRP28_Pos)              /* (MCAN_TXBRP) Transmission Request Pending for Buffer 28 Mask */
#define MCAN_TXBRP_TRP28(value)               (MCAN_TXBRP_TRP28_Msk & (_UINT32_(value) << MCAN_TXBRP_TRP28_Pos)) /* Assigment of value for TRP28 in the MCAN_TXBRP register */
#define MCAN_TXBRP_TRP29_Pos                  _UINT32_(29)                                         /* (MCAN_TXBRP) Transmission Request Pending for Buffer 29 Position */
#define MCAN_TXBRP_TRP29_Msk                  (_UINT32_(0x1) << MCAN_TXBRP_TRP29_Pos)              /* (MCAN_TXBRP) Transmission Request Pending for Buffer 29 Mask */
#define MCAN_TXBRP_TRP29(value)               (MCAN_TXBRP_TRP29_Msk & (_UINT32_(value) << MCAN_TXBRP_TRP29_Pos)) /* Assigment of value for TRP29 in the MCAN_TXBRP register */
#define MCAN_TXBRP_TRP30_Pos                  _UINT32_(30)                                         /* (MCAN_TXBRP) Transmission Request Pending for Buffer 30 Position */
#define MCAN_TXBRP_TRP30_Msk                  (_UINT32_(0x1) << MCAN_TXBRP_TRP30_Pos)              /* (MCAN_TXBRP) Transmission Request Pending for Buffer 30 Mask */
#define MCAN_TXBRP_TRP30(value)               (MCAN_TXBRP_TRP30_Msk & (_UINT32_(value) << MCAN_TXBRP_TRP30_Pos)) /* Assigment of value for TRP30 in the MCAN_TXBRP register */
#define MCAN_TXBRP_TRP31_Pos                  _UINT32_(31)                                         /* (MCAN_TXBRP) Transmission Request Pending for Buffer 31 Position */
#define MCAN_TXBRP_TRP31_Msk                  (_UINT32_(0x1) << MCAN_TXBRP_TRP31_Pos)              /* (MCAN_TXBRP) Transmission Request Pending for Buffer 31 Mask */
#define MCAN_TXBRP_TRP31(value)               (MCAN_TXBRP_TRP31_Msk & (_UINT32_(value) << MCAN_TXBRP_TRP31_Pos)) /* Assigment of value for TRP31 in the MCAN_TXBRP register */
#define MCAN_TXBRP_Msk                        _UINT32_(0xFFFFFFFF)                                 /* (MCAN_TXBRP) Register Mask  */

#define MCAN_TXBRP_TRP_Pos                    _UINT32_(0)                                          /* (MCAN_TXBRP Position) Transmission Request Pending for Buffer 3x */
#define MCAN_TXBRP_TRP_Msk                    (_UINT32_(0xFFFFFFFF) << MCAN_TXBRP_TRP_Pos)         /* (MCAN_TXBRP Mask) TRP */
#define MCAN_TXBRP_TRP(value)                 (MCAN_TXBRP_TRP_Msk & (_UINT32_(value) << MCAN_TXBRP_TRP_Pos)) 

