Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/firmware/src/packs/PIC32CZ2051CA70144_DFP/component/mcan.h
/* -------- MCAN_TXBCR : (MCAN Offset: 0xD4) (R/W 32) Transmit Buffer Cancellation Request Register -------- */
#define MCAN_TXBCR_CR0_Pos                    _UINT32_(0)                                          /* (MCAN_TXBCR) Cancellation Request for Transmit Buffer 0 Position */
#define MCAN_TXBCR_CR0_Msk                    (_UINT32_(0x1) << MCAN_TXBCR_CR0_Pos)                /* (MCAN_TXBCR) Cancellation Request for Transmit Buffer 0 Mask */
#define MCAN_TXBCR_CR0(value)                 (MCAN_TXBCR_CR0_Msk & (_UINT32_(value) << MCAN_TXBCR_CR0_Pos)) /* Assigment of value for CR0 in the MCAN_TXBCR register */
#define MCAN_TXBCR_CR1_Pos                    _UINT32_(1)                                          /* (MCAN_TXBCR) Cancellation Request for Transmit Buffer 1 Position */
#define MCAN_TXBCR_CR1_Msk                    (_UINT32_(0x1) << MCAN_TXBCR_CR1_Pos)                /* (MCAN_TXBCR) Cancellation Request for Transmit Buffer 1 Mask */
#define MCAN_TXBCR_CR1(value)                 (MCAN_TXBCR_CR1_Msk & (_UINT32_(value) << MCAN_TXBCR_CR1_Pos)) /* Assigment of value for CR1 in the MCAN_TXBCR register */
#define MCAN_TXBCR_CR2_Pos                    _UINT32_(2)                                          /* (MCAN_TXBCR) Cancellation Request for Transmit Buffer 2 Position */
#define MCAN_TXBCR_CR2_Msk                    (_UINT32_(0x1) << MCAN_TXBCR_CR2_Pos)                /* (MCAN_TXBCR) Cancellation Request for Transmit Buffer 2 Mask */
#define MCAN_TXBCR_CR2(value)                 (MCAN_TXBCR_CR2_Msk & (_UINT32_(value) << MCAN_TXBCR_CR2_Pos)) /* Assigment of value for CR2 in the MCAN_TXBCR register */
#define MCAN_TXBCR_CR3_Pos                    _UINT32_(3)                                          /* (MCAN_TXBCR) Cancellation Request for Transmit Buffer 3 Position */
#define MCAN_TXBCR_CR3_Msk                    (_UINT32_(0x1) << MCAN_TXBCR_CR3_Pos)                /* (MCAN_TXBCR) Cancellation Request for Transmit Buffer 3 Mask */
#define MCAN_TXBCR_CR3(value)                 (MCAN_TXBCR_CR3_Msk & (_UINT32_(value) << MCAN_TXBCR_CR3_Pos)) /* Assigment of value for CR3 in the MCAN_TXBCR register */
#define MCAN_TXBCR_CR4_Pos                    _UINT32_(4)                                          /* (MCAN_TXBCR) Cancellation Request for Transmit Buffer 4 Position */
#define MCAN_TXBCR_CR4_Msk                    (_UINT32_(0x1) << MCAN_TXBCR_CR4_Pos)                /* (MCAN_TXBCR) Cancellation Request for Transmit Buffer 4 Mask */
#define MCAN_TXBCR_CR4(value)                 (MCAN_TXBCR_CR4_Msk & (_UINT32_(value) << MCAN_TXBCR_CR4_Pos)) /* Assigment of value for CR4 in the MCAN_TXBCR register */
#define MCAN_TXBCR_CR5_Pos                    _UINT32_(5)                                          /* (MCAN_TXBCR) Cancellation Request for Transmit Buffer 5 Position */
#define MCAN_TXBCR_CR5_Msk                    (_UINT32_(0x1) << MCAN_TXBCR_CR5_Pos)                /* (MCAN_TXBCR) Cancellation Request for Transmit Buffer 5 Mask */
#define MCAN_TXBCR_CR5(value)                 (MCAN_TXBCR_CR5_Msk & (_UINT32_(value) << MCAN_TXBCR_CR5_Pos)) /* Assigment of value for CR5 in the MCAN_TXBCR register */
#define MCAN_TXBCR_CR6_Pos                    _UINT32_(6)                                          /* (MCAN_TXBCR) Cancellation Request for Transmit Buffer 6 Position */
#define MCAN_TXBCR_CR6_Msk                    (_UINT32_(0x1) << MCAN_TXBCR_CR6_Pos)                /* (MCAN_TXBCR) Cancellation Request for Transmit Buffer 6 Mask */
#define MCAN_TXBCR_CR6(value)                 (MCAN_TXBCR_CR6_Msk & (_UINT32_(value) << MCAN_TXBCR_CR6_Pos)) /* Assigment of value for CR6 in the MCAN_TXBCR register */
#define MCAN_TXBCR_CR7_Pos                    _UINT32_(7)                                          /* (MCAN_TXBCR) Cancellation Request for Transmit Buffer 7 Position */
#define MCAN_TXBCR_CR7_Msk                    (_UINT32_(0x1) << MCAN_TXBCR_CR7_Pos)                /* (MCAN_TXBCR) Cancellation Request for Transmit Buffer 7 Mask */
#define MCAN_TXBCR_CR7(value)                 (MCAN_TXBCR_CR7_Msk & (_UINT32_(value) << MCAN_TXBCR_CR7_Pos)) /* Assigment of value for CR7 in the MCAN_TXBCR register */
#define MCAN_TXBCR_CR8_Pos                    _UINT32_(8)                                          /* (MCAN_TXBCR) Cancellation Request for Transmit Buffer 8 Position */
#define MCAN_TXBCR_CR8_Msk                    (_UINT32_(0x1) << MCAN_TXBCR_CR8_Pos)                /* (MCAN_TXBCR) Cancellation Request for Transmit Buffer 8 Mask */
#define MCAN_TXBCR_CR8(value)                 (MCAN_TXBCR_CR8_Msk & (_UINT32_(value) << MCAN_TXBCR_CR8_Pos)) /* Assigment of value for CR8 in the MCAN_TXBCR register */
#define MCAN_TXBCR_CR9_Pos                    _UINT32_(9)                                          /* (MCAN_TXBCR) Cancellation Request for Transmit Buffer 9 Position */
#define MCAN_TXBCR_CR9_Msk                    (_UINT32_(0x1) << MCAN_TXBCR_CR9_Pos)                /* (MCAN_TXBCR) Cancellation Request for Transmit Buffer 9 Mask */
#define MCAN_TXBCR_CR9(value)                 (MCAN_TXBCR_CR9_Msk & (_UINT32_(value) << MCAN_TXBCR_CR9_Pos)) /* Assigment of value for CR9 in the MCAN_TXBCR register */
#define MCAN_TXBCR_CR10_Pos                   _UINT32_(10)                                         /* (MCAN_TXBCR) Cancellation Request for Transmit Buffer 10 Position */
#define MCAN_TXBCR_CR10_Msk                   (_UINT32_(0x1) << MCAN_TXBCR_CR10_Pos)               /* (MCAN_TXBCR) Cancellation Request for Transmit Buffer 10 Mask */
#define MCAN_TXBCR_CR10(value)                (MCAN_TXBCR_CR10_Msk & (_UINT32_(value) << MCAN_TXBCR_CR10_Pos)) /* Assigment of value for CR10 in the MCAN_TXBCR register */
#define MCAN_TXBCR_CR11_Pos                   _UINT32_(11)                                         /* (MCAN_TXBCR) Cancellation Request for Transmit Buffer 11 Position */
#define MCAN_TXBCR_CR11_Msk                   (_UINT32_(0x1) << MCAN_TXBCR_CR11_Pos)               /* (MCAN_TXBCR) Cancellation Request for Transmit Buffer 11 Mask */
#define MCAN_TXBCR_CR11(value)                (MCAN_TXBCR_CR11_Msk & (_UINT32_(value) << MCAN_TXBCR_CR11_Pos)) /* Assigment of value for CR11 in the MCAN_TXBCR register */
#define MCAN_TXBCR_CR12_Pos                   _UINT32_(12)                                         /* (MCAN_TXBCR) Cancellation Request for Transmit Buffer 12 Position */
#define MCAN_TXBCR_CR12_Msk                   (_UINT32_(0x1) << MCAN_TXBCR_CR12_Pos)               /* (MCAN_TXBCR) Cancellation Request for Transmit Buffer 12 Mask */
#define MCAN_TXBCR_CR12(value)                (MCAN_TXBCR_CR12_Msk & (_UINT32_(value) << MCAN_TXBCR_CR12_Pos)) /* Assigment of value for CR12 in the MCAN_TXBCR register */
#define MCAN_TXBCR_CR13_Pos                   _UINT32_(13)                                         /* (MCAN_TXBCR) Cancellation Request for Transmit Buffer 13 Position */
#define MCAN_TXBCR_CR13_Msk                   (_UINT32_(0x1) << MCAN_TXBCR_CR13_Pos)               /* (MCAN_TXBCR) Cancellation Request for Transmit Buffer 13 Mask */
#define MCAN_TXBCR_CR13(value)                (MCAN_TXBCR_CR13_Msk & (_UINT32_(value) << MCAN_TXBCR_CR13_Pos)) /* Assigment of value for CR13 in the MCAN_TXBCR register */
#define MCAN_TXBCR_CR14_Pos                   _UINT32_(14)                                         /* (MCAN_TXBCR) Cancellation Request for Transmit Buffer 14 Position */
#define MCAN_TXBCR_CR14_Msk                   (_UINT32_(0x1) << MCAN_TXBCR_CR14_Pos)               /* (MCAN_TXBCR) Cancellation Request for Transmit Buffer 14 Mask */
#define MCAN_TXBCR_CR14(value)                (MCAN_TXBCR_CR14_Msk & (_UINT32_(value) << MCAN_TXBCR_CR14_Pos)) /* Assigment of value for CR14 in the MCAN_TXBCR register */
#define MCAN_TXBCR_CR15_Pos                   _UINT32_(15)                                         /* (MCAN_TXBCR) Cancellation Request for Transmit Buffer 15 Position */
#define MCAN_TXBCR_CR15_Msk                   (_UINT32_(0x1) << MCAN_TXBCR_CR15_Pos)               /* (MCAN_TXBCR) Cancellation Request for Transmit Buffer 15 Mask */
#define MCAN_TXBCR_CR15(value)                (MCAN_TXBCR_CR15_Msk & (_UINT32_(value) << MCAN_TXBCR_CR15_Pos)) /* Assigment of value for CR15 in the MCAN_TXBCR register */
#define MCAN_TXBCR_CR16_Pos                   _UINT32_(16)                                         /* (MCAN_TXBCR) Cancellation Request for Transmit Buffer 16 Position */
#define MCAN_TXBCR_CR16_Msk                   (_UINT32_(0x1) << MCAN_TXBCR_CR16_Pos)               /* (MCAN_TXBCR) Cancellation Request for Transmit Buffer 16 Mask */
#define MCAN_TXBCR_CR16(value)                (MCAN_TXBCR_CR16_Msk & (_UINT32_(value) << MCAN_TXBCR_CR16_Pos)) /* Assigment of value for CR16 in the MCAN_TXBCR register */
#define MCAN_TXBCR_CR17_Pos                   _UINT32_(17)                                         /* (MCAN_TXBCR) Cancellation Request for Transmit Buffer 17 Position */
#define MCAN_TXBCR_CR17_Msk                   (_UINT32_(0x1) << MCAN_TXBCR_CR17_Pos)               /* (MCAN_TXBCR) Cancellation Request for Transmit Buffer 17 Mask */
#define MCAN_TXBCR_CR17(value)                (MCAN_TXBCR_CR17_Msk & (_UINT32_(value) << MCAN_TXBCR_CR17_Pos)) /* Assigment of value for CR17 in the MCAN_TXBCR register */
#define MCAN_TXBCR_CR18_Pos                   _UINT32_(18)                                         /* (MCAN_TXBCR) Cancellation Request for Transmit Buffer 18 Position */
#define MCAN_TXBCR_CR18_Msk                   (_UINT32_(0x1) << MCAN_TXBCR_CR18_Pos)               /* (MCAN_TXBCR) Cancellation Request for Transmit Buffer 18 Mask */
#define MCAN_TXBCR_CR18(value)                (MCAN_TXBCR_CR18_Msk & (_UINT32_(value) << MCAN_TXBCR_CR18_Pos)) /* Assigment of value for CR18 in the MCAN_TXBCR register */
#define MCAN_TXBCR_CR19_Pos                   _UINT32_(19)                                         /* (MCAN_TXBCR) Cancellation Request for Transmit Buffer 19 Position */
#define MCAN_TXBCR_CR19_Msk                   (_UINT32_(0x1) << MCAN_TXBCR_CR19_Pos)               /* (MCAN_TXBCR) Cancellation Request for Transmit Buffer 19 Mask */
#define MCAN_TXBCR_CR19(value)                (MCAN_TXBCR_CR19_Msk & (_UINT32_(value) << MCAN_TXBCR_CR19_Pos)) /* Assigment of value for CR19 in the MCAN_TXBCR register */
#define MCAN_TXBCR_CR20_Pos                   _UINT32_(20)                                         /* (MCAN_TXBCR) Cancellation Request for Transmit Buffer 20 Position */
#define MCAN_TXBCR_CR20_Msk                   (_UINT32_(0x1) << MCAN_TXBCR_CR20_Pos)               /* (MCAN_TXBCR) Cancellation Request for Transmit Buffer 20 Mask */
#define MCAN_TXBCR_CR20(value)                (MCAN_TXBCR_CR20_Msk & (_UINT32_(value) << MCAN_TXBCR_CR20_Pos)) /* Assigment of value for CR20 in the MCAN_TXBCR register */
#define MCAN_TXBCR_CR21_Pos                   _UINT32_(21)                                         /* (MCAN_TXBCR) Cancellation Request for Transmit Buffer 21 Position */
#define MCAN_TXBCR_CR21_Msk                   (_UINT32_(0x1) << MCAN_TXBCR_CR21_Pos)               /* (MCAN_TXBCR) Cancellation Request for Transmit Buffer 21 Mask */
#define MCAN_TXBCR_CR21(value)                (MCAN_TXBCR_CR21_Msk & (_UINT32_(value) << MCAN_TXBCR_CR21_Pos)) /* Assigment of value for CR21 in the MCAN_TXBCR register */
#define MCAN_TXBCR_CR22_Pos                   _UINT32_(22)                                         /* (MCAN_TXBCR) Cancellation Request for Transmit Buffer 22 Position */
#define MCAN_TXBCR_CR22_Msk                   (_UINT32_(0x1) << MCAN_TXBCR_CR22_Pos)               /* (MCAN_TXBCR) Cancellation Request for Transmit Buffer 22 Mask */
#define MCAN_TXBCR_CR22(value)                (MCAN_TXBCR_CR22_Msk & (_UINT32_(value) << MCAN_TXBCR_CR22_Pos)) /* Assigment of value for CR22 in the MCAN_TXBCR register */
#define MCAN_TXBCR_CR23_Pos                   _UINT32_(23)                                         /* (MCAN_TXBCR) Cancellation Request for Transmit Buffer 23 Position */
#define MCAN_TXBCR_CR23_Msk                   (_UINT32_(0x1) << MCAN_TXBCR_CR23_Pos)               /* (MCAN_TXBCR) Cancellation Request for Transmit Buffer 23 Mask */
#define MCAN_TXBCR_CR23(value)                (MCAN_TXBCR_CR23_Msk & (_UINT32_(value) << MCAN_TXBCR_CR23_Pos)) /* Assigment of value for CR23 in the MCAN_TXBCR register */
#define MCAN_TXBCR_CR24_Pos                   _UINT32_(24)                                         /* (MCAN_TXBCR) Cancellation Request for Transmit Buffer 24 Position */
#define MCAN_TXBCR_CR24_Msk                   (_UINT32_(0x1) << MCAN_TXBCR_CR24_Pos)               /* (MCAN_TXBCR) Cancellation Request for Transmit Buffer 24 Mask */
#define MCAN_TXBCR_CR24(value)                (MCAN_TXBCR_CR24_Msk & (_UINT32_(value) << MCAN_TXBCR_CR24_Pos)) /* Assigment of value for CR24 in the MCAN_TXBCR register */
#define MCAN_TXBCR_CR25_Pos                   _UINT32_(25)                                         /* (MCAN_TXBCR) Cancellation Request for Transmit Buffer 25 Position */
#define MCAN_TXBCR_CR25_Msk                   (_UINT32_(0x1) << MCAN_TXBCR_CR25_Pos)               /* (MCAN_TXBCR) Cancellation Request for Transmit Buffer 25 Mask */
#define MCAN_TXBCR_CR25(value)                (MCAN_TXBCR_CR25_Msk & (_UINT32_(value) << MCAN_TXBCR_CR25_Pos)) /* Assigment of value for CR25 in the MCAN_TXBCR register */
#define MCAN_TXBCR_CR26_Pos                   _UINT32_(26)                                         /* (MCAN_TXBCR) Cancellation Request for Transmit Buffer 26 Position */
#define MCAN_TXBCR_CR26_Msk                   (_UINT32_(0x1) << MCAN_TXBCR_CR26_Pos)               /* (MCAN_TXBCR) Cancellation Request for Transmit Buffer 26 Mask */
#define MCAN_TXBCR_CR26(value)                (MCAN_TXBCR_CR26_Msk & (_UINT32_(value) << MCAN_TXBCR_CR26_Pos)) /* Assigment of value for CR26 in the MCAN_TXBCR register */
#define MCAN_TXBCR_CR27_Pos                   _UINT32_(27)                                         /* (MCAN_TXBCR) Cancellation Request for Transmit Buffer 27 Position */
#define MCAN_TXBCR_CR27_Msk                   (_UINT32_(0x1) << MCAN_TXBCR_CR27_Pos)               /* (MCAN_TXBCR) Cancellation Request for Transmit Buffer 27 Mask */
#define MCAN_TXBCR_CR27(value)                (MCAN_TXBCR_CR27_Msk & (_UINT32_(value) << MCAN_TXBCR_CR27_Pos)) /* Assigment of value for CR27 in the MCAN_TXBCR register */
#define MCAN_TXBCR_CR28_Pos                   _UINT32_(28)                                         /* (MCAN_TXBCR) Cancellation Request for Transmit Buffer 28 Position */
#define MCAN_TXBCR_CR28_Msk                   (_UINT32_(0x1) << MCAN_TXBCR_CR28_Pos)               /* (MCAN_TXBCR) Cancellation Request for Transmit Buffer 28 Mask */
#define MCAN_TXBCR_CR28(value)                (MCAN_TXBCR_CR28_Msk & (_UINT32_(value) << MCAN_TXBCR_CR28_Pos)) /* Assigment of value for CR28 in the MCAN_TXBCR register */
#define MCAN_TXBCR_CR29_Pos                   _UINT32_(29)                                         /* (MCAN_TXBCR) Cancellation Request for Transmit Buffer 29 Position */
#define MCAN_TXBCR_CR29_Msk                   (_UINT32_(0x1) << MCAN_TXBCR_CR29_Pos)               /* (MCAN_TXBCR) Cancellation Request for Transmit Buffer 29 Mask */
#define MCAN_TXBCR_CR29(value)                (MCAN_TXBCR_CR29_Msk & (_UINT32_(value) << MCAN_TXBCR_CR29_Pos)) /* Assigment of value for CR29 in the MCAN_TXBCR register */
#define MCAN_TXBCR_CR30_Pos                   _UINT32_(30)                                         /* (MCAN_TXBCR) Cancellation Request for Transmit Buffer 30 Position */
#define MCAN_TXBCR_CR30_Msk                   (_UINT32_(0x1) << MCAN_TXBCR_CR30_Pos)               /* (MCAN_TXBCR) Cancellation Request for Transmit Buffer 30 Mask */
#define MCAN_TXBCR_CR30(value)                (MCAN_TXBCR_CR30_Msk & (_UINT32_(value) << MCAN_TXBCR_CR30_Pos)) /* Assigment of value for CR30 in the MCAN_TXBCR register */
#define MCAN_TXBCR_CR31_Pos                   _UINT32_(31)                                         /* (MCAN_TXBCR) Cancellation Request for Transmit Buffer 31 Position */
#define MCAN_TXBCR_CR31_Msk                   (_UINT32_(0x1) << MCAN_TXBCR_CR31_Pos)               /* (MCAN_TXBCR) Cancellation Request for Transmit Buffer 31 Mask */
#define MCAN_TXBCR_CR31(value)                (MCAN_TXBCR_CR31_Msk & (_UINT32_(value) << MCAN_TXBCR_CR31_Pos)) /* Assigment of value for CR31 in the MCAN_TXBCR register */
#define MCAN_TXBCR_Msk                        _UINT32_(0xFFFFFFFF)                                 /* (MCAN_TXBCR) Register Mask  */

