Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/firmware/src/packs/PIC32CZ2051CA70144_DFP/component/mcan.h
#define MCAN_TXBCR_CR_Pos                     _UINT32_(0)                                          /* (MCAN_TXBCR Position) Cancellation Request for Transmit Buffer 3x */
#define MCAN_TXBCR_CR_Msk                     (_UINT32_(0xFFFFFFFF) << MCAN_TXBCR_CR_Pos)          /* (MCAN_TXBCR Mask) CR */
#define MCAN_TXBCR_CR(value)                  (MCAN_TXBCR_CR_Msk & (_UINT32_(value) << MCAN_TXBCR_CR_Pos)) 

/* -------- MCAN_TXBTO : (MCAN Offset: 0xD8) ( R/ 32) Transmit Buffer Transmission Occurred Register -------- */
#define MCAN_TXBTO_TO0_Pos                    _UINT32_(0)                                          /* (MCAN_TXBTO) Transmission Occurred for Buffer 0 Position */
#define MCAN_TXBTO_TO0_Msk                    (_UINT32_(0x1) << MCAN_TXBTO_TO0_Pos)                /* (MCAN_TXBTO) Transmission Occurred for Buffer 0 Mask */
#define MCAN_TXBTO_TO0(value)                 (MCAN_TXBTO_TO0_Msk & (_UINT32_(value) << MCAN_TXBTO_TO0_Pos)) /* Assigment of value for TO0 in the MCAN_TXBTO register */
#define MCAN_TXBTO_TO1_Pos                    _UINT32_(1)                                          /* (MCAN_TXBTO) Transmission Occurred for Buffer 1 Position */
#define MCAN_TXBTO_TO1_Msk                    (_UINT32_(0x1) << MCAN_TXBTO_TO1_Pos)                /* (MCAN_TXBTO) Transmission Occurred for Buffer 1 Mask */
#define MCAN_TXBTO_TO1(value)                 (MCAN_TXBTO_TO1_Msk & (_UINT32_(value) << MCAN_TXBTO_TO1_Pos)) /* Assigment of value for TO1 in the MCAN_TXBTO register */
#define MCAN_TXBTO_TO2_Pos                    _UINT32_(2)                                          /* (MCAN_TXBTO) Transmission Occurred for Buffer 2 Position */
#define MCAN_TXBTO_TO2_Msk                    (_UINT32_(0x1) << MCAN_TXBTO_TO2_Pos)                /* (MCAN_TXBTO) Transmission Occurred for Buffer 2 Mask */
#define MCAN_TXBTO_TO2(value)                 (MCAN_TXBTO_TO2_Msk & (_UINT32_(value) << MCAN_TXBTO_TO2_Pos)) /* Assigment of value for TO2 in the MCAN_TXBTO register */
#define MCAN_TXBTO_TO3_Pos                    _UINT32_(3)                                          /* (MCAN_TXBTO) Transmission Occurred for Buffer 3 Position */
#define MCAN_TXBTO_TO3_Msk                    (_UINT32_(0x1) << MCAN_TXBTO_TO3_Pos)                /* (MCAN_TXBTO) Transmission Occurred for Buffer 3 Mask */
#define MCAN_TXBTO_TO3(value)                 (MCAN_TXBTO_TO3_Msk & (_UINT32_(value) << MCAN_TXBTO_TO3_Pos)) /* Assigment of value for TO3 in the MCAN_TXBTO register */
#define MCAN_TXBTO_TO4_Pos                    _UINT32_(4)                                          /* (MCAN_TXBTO) Transmission Occurred for Buffer 4 Position */
#define MCAN_TXBTO_TO4_Msk                    (_UINT32_(0x1) << MCAN_TXBTO_TO4_Pos)                /* (MCAN_TXBTO) Transmission Occurred for Buffer 4 Mask */
#define MCAN_TXBTO_TO4(value)                 (MCAN_TXBTO_TO4_Msk & (_UINT32_(value) << MCAN_TXBTO_TO4_Pos)) /* Assigment of value for TO4 in the MCAN_TXBTO register */
#define MCAN_TXBTO_TO5_Pos                    _UINT32_(5)                                          /* (MCAN_TXBTO) Transmission Occurred for Buffer 5 Position */
#define MCAN_TXBTO_TO5_Msk                    (_UINT32_(0x1) << MCAN_TXBTO_TO5_Pos)                /* (MCAN_TXBTO) Transmission Occurred for Buffer 5 Mask */
#define MCAN_TXBTO_TO5(value)                 (MCAN_TXBTO_TO5_Msk & (_UINT32_(value) << MCAN_TXBTO_TO5_Pos)) /* Assigment of value for TO5 in the MCAN_TXBTO register */
#define MCAN_TXBTO_TO6_Pos                    _UINT32_(6)                                          /* (MCAN_TXBTO) Transmission Occurred for Buffer 6 Position */
#define MCAN_TXBTO_TO6_Msk                    (_UINT32_(0x1) << MCAN_TXBTO_TO6_Pos)                /* (MCAN_TXBTO) Transmission Occurred for Buffer 6 Mask */
#define MCAN_TXBTO_TO6(value)                 (MCAN_TXBTO_TO6_Msk & (_UINT32_(value) << MCAN_TXBTO_TO6_Pos)) /* Assigment of value for TO6 in the MCAN_TXBTO register */
#define MCAN_TXBTO_TO7_Pos                    _UINT32_(7)                                          /* (MCAN_TXBTO) Transmission Occurred for Buffer 7 Position */
#define MCAN_TXBTO_TO7_Msk                    (_UINT32_(0x1) << MCAN_TXBTO_TO7_Pos)                /* (MCAN_TXBTO) Transmission Occurred for Buffer 7 Mask */
#define MCAN_TXBTO_TO7(value)                 (MCAN_TXBTO_TO7_Msk & (_UINT32_(value) << MCAN_TXBTO_TO7_Pos)) /* Assigment of value for TO7 in the MCAN_TXBTO register */
#define MCAN_TXBTO_TO8_Pos                    _UINT32_(8)                                          /* (MCAN_TXBTO) Transmission Occurred for Buffer 8 Position */
#define MCAN_TXBTO_TO8_Msk                    (_UINT32_(0x1) << MCAN_TXBTO_TO8_Pos)                /* (MCAN_TXBTO) Transmission Occurred for Buffer 8 Mask */
#define MCAN_TXBTO_TO8(value)                 (MCAN_TXBTO_TO8_Msk & (_UINT32_(value) << MCAN_TXBTO_TO8_Pos)) /* Assigment of value for TO8 in the MCAN_TXBTO register */
#define MCAN_TXBTO_TO9_Pos                    _UINT32_(9)                                          /* (MCAN_TXBTO) Transmission Occurred for Buffer 9 Position */
#define MCAN_TXBTO_TO9_Msk                    (_UINT32_(0x1) << MCAN_TXBTO_TO9_Pos)                /* (MCAN_TXBTO) Transmission Occurred for Buffer 9 Mask */
#define MCAN_TXBTO_TO9(value)                 (MCAN_TXBTO_TO9_Msk & (_UINT32_(value) << MCAN_TXBTO_TO9_Pos)) /* Assigment of value for TO9 in the MCAN_TXBTO register */
#define MCAN_TXBTO_TO10_Pos                   _UINT32_(10)                                         /* (MCAN_TXBTO) Transmission Occurred for Buffer 10 Position */
#define MCAN_TXBTO_TO10_Msk                   (_UINT32_(0x1) << MCAN_TXBTO_TO10_Pos)               /* (MCAN_TXBTO) Transmission Occurred for Buffer 10 Mask */
#define MCAN_TXBTO_TO10(value)                (MCAN_TXBTO_TO10_Msk & (_UINT32_(value) << MCAN_TXBTO_TO10_Pos)) /* Assigment of value for TO10 in the MCAN_TXBTO register */
#define MCAN_TXBTO_TO11_Pos                   _UINT32_(11)                                         /* (MCAN_TXBTO) Transmission Occurred for Buffer 11 Position */
#define MCAN_TXBTO_TO11_Msk                   (_UINT32_(0x1) << MCAN_TXBTO_TO11_Pos)               /* (MCAN_TXBTO) Transmission Occurred for Buffer 11 Mask */
#define MCAN_TXBTO_TO11(value)                (MCAN_TXBTO_TO11_Msk & (_UINT32_(value) << MCAN_TXBTO_TO11_Pos)) /* Assigment of value for TO11 in the MCAN_TXBTO register */
#define MCAN_TXBTO_TO12_Pos                   _UINT32_(12)                                         /* (MCAN_TXBTO) Transmission Occurred for Buffer 12 Position */
#define MCAN_TXBTO_TO12_Msk                   (_UINT32_(0x1) << MCAN_TXBTO_TO12_Pos)               /* (MCAN_TXBTO) Transmission Occurred for Buffer 12 Mask */
#define MCAN_TXBTO_TO12(value)                (MCAN_TXBTO_TO12_Msk & (_UINT32_(value) << MCAN_TXBTO_TO12_Pos)) /* Assigment of value for TO12 in the MCAN_TXBTO register */
#define MCAN_TXBTO_TO13_Pos                   _UINT32_(13)                                         /* (MCAN_TXBTO) Transmission Occurred for Buffer 13 Position */
#define MCAN_TXBTO_TO13_Msk                   (_UINT32_(0x1) << MCAN_TXBTO_TO13_Pos)               /* (MCAN_TXBTO) Transmission Occurred for Buffer 13 Mask */
#define MCAN_TXBTO_TO13(value)                (MCAN_TXBTO_TO13_Msk & (_UINT32_(value) << MCAN_TXBTO_TO13_Pos)) /* Assigment of value for TO13 in the MCAN_TXBTO register */
#define MCAN_TXBTO_TO14_Pos                   _UINT32_(14)                                         /* (MCAN_TXBTO) Transmission Occurred for Buffer 14 Position */
#define MCAN_TXBTO_TO14_Msk                   (_UINT32_(0x1) << MCAN_TXBTO_TO14_Pos)               /* (MCAN_TXBTO) Transmission Occurred for Buffer 14 Mask */
#define MCAN_TXBTO_TO14(value)                (MCAN_TXBTO_TO14_Msk & (_UINT32_(value) << MCAN_TXBTO_TO14_Pos)) /* Assigment of value for TO14 in the MCAN_TXBTO register */
#define MCAN_TXBTO_TO15_Pos                   _UINT32_(15)                                         /* (MCAN_TXBTO) Transmission Occurred for Buffer 15 Position */
#define MCAN_TXBTO_TO15_Msk                   (_UINT32_(0x1) << MCAN_TXBTO_TO15_Pos)               /* (MCAN_TXBTO) Transmission Occurred for Buffer 15 Mask */
#define MCAN_TXBTO_TO15(value)                (MCAN_TXBTO_TO15_Msk & (_UINT32_(value) << MCAN_TXBTO_TO15_Pos)) /* Assigment of value for TO15 in the MCAN_TXBTO register */
#define MCAN_TXBTO_TO16_Pos                   _UINT32_(16)                                         /* (MCAN_TXBTO) Transmission Occurred for Buffer 16 Position */
#define MCAN_TXBTO_TO16_Msk                   (_UINT32_(0x1) << MCAN_TXBTO_TO16_Pos)               /* (MCAN_TXBTO) Transmission Occurred for Buffer 16 Mask */
#define MCAN_TXBTO_TO16(value)                (MCAN_TXBTO_TO16_Msk & (_UINT32_(value) << MCAN_TXBTO_TO16_Pos)) /* Assigment of value for TO16 in the MCAN_TXBTO register */
#define MCAN_TXBTO_TO17_Pos                   _UINT32_(17)                                         /* (MCAN_TXBTO) Transmission Occurred for Buffer 17 Position */
#define MCAN_TXBTO_TO17_Msk                   (_UINT32_(0x1) << MCAN_TXBTO_TO17_Pos)               /* (MCAN_TXBTO) Transmission Occurred for Buffer 17 Mask */
#define MCAN_TXBTO_TO17(value)                (MCAN_TXBTO_TO17_Msk & (_UINT32_(value) << MCAN_TXBTO_TO17_Pos)) /* Assigment of value for TO17 in the MCAN_TXBTO register */
#define MCAN_TXBTO_TO18_Pos                   _UINT32_(18)                                         /* (MCAN_TXBTO) Transmission Occurred for Buffer 18 Position */
#define MCAN_TXBTO_TO18_Msk                   (_UINT32_(0x1) << MCAN_TXBTO_TO18_Pos)               /* (MCAN_TXBTO) Transmission Occurred for Buffer 18 Mask */
#define MCAN_TXBTO_TO18(value)                (MCAN_TXBTO_TO18_Msk & (_UINT32_(value) << MCAN_TXBTO_TO18_Pos)) /* Assigment of value for TO18 in the MCAN_TXBTO register */
#define MCAN_TXBTO_TO19_Pos                   _UINT32_(19)                                         /* (MCAN_TXBTO) Transmission Occurred for Buffer 19 Position */
#define MCAN_TXBTO_TO19_Msk                   (_UINT32_(0x1) << MCAN_TXBTO_TO19_Pos)               /* (MCAN_TXBTO) Transmission Occurred for Buffer 19 Mask */
#define MCAN_TXBTO_TO19(value)                (MCAN_TXBTO_TO19_Msk & (_UINT32_(value) << MCAN_TXBTO_TO19_Pos)) /* Assigment of value for TO19 in the MCAN_TXBTO register */
#define MCAN_TXBTO_TO20_Pos                   _UINT32_(20)                                         /* (MCAN_TXBTO) Transmission Occurred for Buffer 20 Position */
#define MCAN_TXBTO_TO20_Msk                   (_UINT32_(0x1) << MCAN_TXBTO_TO20_Pos)               /* (MCAN_TXBTO) Transmission Occurred for Buffer 20 Mask */
#define MCAN_TXBTO_TO20(value)                (MCAN_TXBTO_TO20_Msk & (_UINT32_(value) << MCAN_TXBTO_TO20_Pos)) /* Assigment of value for TO20 in the MCAN_TXBTO register */
#define MCAN_TXBTO_TO21_Pos                   _UINT32_(21)                                         /* (MCAN_TXBTO) Transmission Occurred for Buffer 21 Position */
#define MCAN_TXBTO_TO21_Msk                   (_UINT32_(0x1) << MCAN_TXBTO_TO21_Pos)               /* (MCAN_TXBTO) Transmission Occurred for Buffer 21 Mask */
#define MCAN_TXBTO_TO21(value)                (MCAN_TXBTO_TO21_Msk & (_UINT32_(value) << MCAN_TXBTO_TO21_Pos)) /* Assigment of value for TO21 in the MCAN_TXBTO register */
#define MCAN_TXBTO_TO22_Pos                   _UINT32_(22)                                         /* (MCAN_TXBTO) Transmission Occurred for Buffer 22 Position */
#define MCAN_TXBTO_TO22_Msk                   (_UINT32_(0x1) << MCAN_TXBTO_TO22_Pos)               /* (MCAN_TXBTO) Transmission Occurred for Buffer 22 Mask */
#define MCAN_TXBTO_TO22(value)                (MCAN_TXBTO_TO22_Msk & (_UINT32_(value) << MCAN_TXBTO_TO22_Pos)) /* Assigment of value for TO22 in the MCAN_TXBTO register */
#define MCAN_TXBTO_TO23_Pos                   _UINT32_(23)                                         /* (MCAN_TXBTO) Transmission Occurred for Buffer 23 Position */
#define MCAN_TXBTO_TO23_Msk                   (_UINT32_(0x1) << MCAN_TXBTO_TO23_Pos)               /* (MCAN_TXBTO) Transmission Occurred for Buffer 23 Mask */
#define MCAN_TXBTO_TO23(value)                (MCAN_TXBTO_TO23_Msk & (_UINT32_(value) << MCAN_TXBTO_TO23_Pos)) /* Assigment of value for TO23 in the MCAN_TXBTO register */
#define MCAN_TXBTO_TO24_Pos                   _UINT32_(24)                                         /* (MCAN_TXBTO) Transmission Occurred for Buffer 24 Position */
#define MCAN_TXBTO_TO24_Msk                   (_UINT32_(0x1) << MCAN_TXBTO_TO24_Pos)               /* (MCAN_TXBTO) Transmission Occurred for Buffer 24 Mask */
#define MCAN_TXBTO_TO24(value)                (MCAN_TXBTO_TO24_Msk & (_UINT32_(value) << MCAN_TXBTO_TO24_Pos)) /* Assigment of value for TO24 in the MCAN_TXBTO register */
#define MCAN_TXBTO_TO25_Pos                   _UINT32_(25)                                         /* (MCAN_TXBTO) Transmission Occurred for Buffer 25 Position */
#define MCAN_TXBTO_TO25_Msk                   (_UINT32_(0x1) << MCAN_TXBTO_TO25_Pos)               /* (MCAN_TXBTO) Transmission Occurred for Buffer 25 Mask */
#define MCAN_TXBTO_TO25(value)                (MCAN_TXBTO_TO25_Msk & (_UINT32_(value) << MCAN_TXBTO_TO25_Pos)) /* Assigment of value for TO25 in the MCAN_TXBTO register */
#define MCAN_TXBTO_TO26_Pos                   _UINT32_(26)                                         /* (MCAN_TXBTO) Transmission Occurred for Buffer 26 Position */
#define MCAN_TXBTO_TO26_Msk                   (_UINT32_(0x1) << MCAN_TXBTO_TO26_Pos)               /* (MCAN_TXBTO) Transmission Occurred for Buffer 26 Mask */
#define MCAN_TXBTO_TO26(value)                (MCAN_TXBTO_TO26_Msk & (_UINT32_(value) << MCAN_TXBTO_TO26_Pos)) /* Assigment of value for TO26 in the MCAN_TXBTO register */
#define MCAN_TXBTO_TO27_Pos                   _UINT32_(27)                                         /* (MCAN_TXBTO) Transmission Occurred for Buffer 27 Position */
#define MCAN_TXBTO_TO27_Msk                   (_UINT32_(0x1) << MCAN_TXBTO_TO27_Pos)               /* (MCAN_TXBTO) Transmission Occurred for Buffer 27 Mask */
#define MCAN_TXBTO_TO27(value)                (MCAN_TXBTO_TO27_Msk & (_UINT32_(value) << MCAN_TXBTO_TO27_Pos)) /* Assigment of value for TO27 in the MCAN_TXBTO register */
#define MCAN_TXBTO_TO28_Pos                   _UINT32_(28)                                         /* (MCAN_TXBTO) Transmission Occurred for Buffer 28 Position */
#define MCAN_TXBTO_TO28_Msk                   (_UINT32_(0x1) << MCAN_TXBTO_TO28_Pos)               /* (MCAN_TXBTO) Transmission Occurred for Buffer 28 Mask */
#define MCAN_TXBTO_TO28(value)                (MCAN_TXBTO_TO28_Msk & (_UINT32_(value) << MCAN_TXBTO_TO28_Pos)) /* Assigment of value for TO28 in the MCAN_TXBTO register */
#define MCAN_TXBTO_TO29_Pos                   _UINT32_(29)                                         /* (MCAN_TXBTO) Transmission Occurred for Buffer 29 Position */
#define MCAN_TXBTO_TO29_Msk                   (_UINT32_(0x1) << MCAN_TXBTO_TO29_Pos)               /* (MCAN_TXBTO) Transmission Occurred for Buffer 29 Mask */
#define MCAN_TXBTO_TO29(value)                (MCAN_TXBTO_TO29_Msk & (_UINT32_(value) << MCAN_TXBTO_TO29_Pos)) /* Assigment of value for TO29 in the MCAN_TXBTO register */
#define MCAN_TXBTO_TO30_Pos                   _UINT32_(30)                                         /* (MCAN_TXBTO) Transmission Occurred for Buffer 30 Position */
#define MCAN_TXBTO_TO30_Msk                   (_UINT32_(0x1) << MCAN_TXBTO_TO30_Pos)               /* (MCAN_TXBTO) Transmission Occurred for Buffer 30 Mask */
#define MCAN_TXBTO_TO30(value)                (MCAN_TXBTO_TO30_Msk & (_UINT32_(value) << MCAN_TXBTO_TO30_Pos)) /* Assigment of value for TO30 in the MCAN_TXBTO register */
#define MCAN_TXBTO_TO31_Pos                   _UINT32_(31)                                         /* (MCAN_TXBTO) Transmission Occurred for Buffer 31 Position */
#define MCAN_TXBTO_TO31_Msk                   (_UINT32_(0x1) << MCAN_TXBTO_TO31_Pos)               /* (MCAN_TXBTO) Transmission Occurred for Buffer 31 Mask */
#define MCAN_TXBTO_TO31(value)                (MCAN_TXBTO_TO31_Msk & (_UINT32_(value) << MCAN_TXBTO_TO31_Pos)) /* Assigment of value for TO31 in the MCAN_TXBTO register */
#define MCAN_TXBTO_Msk                        _UINT32_(0xFFFFFFFF)                                 /* (MCAN_TXBTO) Register Mask  */

#define MCAN_TXBTO_TO_Pos                     _UINT32_(0)                                          /* (MCAN_TXBTO Position) Transmission Occurred for Buffer 3x */
#define MCAN_TXBTO_TO_Msk                     (_UINT32_(0xFFFFFFFF) << MCAN_TXBTO_TO_Pos)          /* (MCAN_TXBTO Mask) TO */
#define MCAN_TXBTO_TO(value)                  (MCAN_TXBTO_TO_Msk & (_UINT32_(value) << MCAN_TXBTO_TO_Pos)) 

