Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/firmware/src/packs/PIC32CZ2051CA70144_DFP/component/mcan.h
/* -------- MCAN_TXBCF : (MCAN Offset: 0xDC) ( R/ 32) Transmit Buffer Cancellation Finished Register -------- */
#define MCAN_TXBCF_CF0_Pos                    _UINT32_(0)                                          /* (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 0 Position */
#define MCAN_TXBCF_CF0_Msk                    (_UINT32_(0x1) << MCAN_TXBCF_CF0_Pos)                /* (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 0 Mask */
#define MCAN_TXBCF_CF0(value)                 (MCAN_TXBCF_CF0_Msk & (_UINT32_(value) << MCAN_TXBCF_CF0_Pos)) /* Assigment of value for CF0 in the MCAN_TXBCF register */
#define MCAN_TXBCF_CF1_Pos                    _UINT32_(1)                                          /* (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 1 Position */
#define MCAN_TXBCF_CF1_Msk                    (_UINT32_(0x1) << MCAN_TXBCF_CF1_Pos)                /* (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 1 Mask */
#define MCAN_TXBCF_CF1(value)                 (MCAN_TXBCF_CF1_Msk & (_UINT32_(value) << MCAN_TXBCF_CF1_Pos)) /* Assigment of value for CF1 in the MCAN_TXBCF register */
#define MCAN_TXBCF_CF2_Pos                    _UINT32_(2)                                          /* (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 2 Position */
#define MCAN_TXBCF_CF2_Msk                    (_UINT32_(0x1) << MCAN_TXBCF_CF2_Pos)                /* (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 2 Mask */
#define MCAN_TXBCF_CF2(value)                 (MCAN_TXBCF_CF2_Msk & (_UINT32_(value) << MCAN_TXBCF_CF2_Pos)) /* Assigment of value for CF2 in the MCAN_TXBCF register */
#define MCAN_TXBCF_CF3_Pos                    _UINT32_(3)                                          /* (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 3 Position */
#define MCAN_TXBCF_CF3_Msk                    (_UINT32_(0x1) << MCAN_TXBCF_CF3_Pos)                /* (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 3 Mask */
#define MCAN_TXBCF_CF3(value)                 (MCAN_TXBCF_CF3_Msk & (_UINT32_(value) << MCAN_TXBCF_CF3_Pos)) /* Assigment of value for CF3 in the MCAN_TXBCF register */
#define MCAN_TXBCF_CF4_Pos                    _UINT32_(4)                                          /* (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 4 Position */
#define MCAN_TXBCF_CF4_Msk                    (_UINT32_(0x1) << MCAN_TXBCF_CF4_Pos)                /* (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 4 Mask */
#define MCAN_TXBCF_CF4(value)                 (MCAN_TXBCF_CF4_Msk & (_UINT32_(value) << MCAN_TXBCF_CF4_Pos)) /* Assigment of value for CF4 in the MCAN_TXBCF register */
#define MCAN_TXBCF_CF5_Pos                    _UINT32_(5)                                          /* (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 5 Position */
#define MCAN_TXBCF_CF5_Msk                    (_UINT32_(0x1) << MCAN_TXBCF_CF5_Pos)                /* (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 5 Mask */
#define MCAN_TXBCF_CF5(value)                 (MCAN_TXBCF_CF5_Msk & (_UINT32_(value) << MCAN_TXBCF_CF5_Pos)) /* Assigment of value for CF5 in the MCAN_TXBCF register */
#define MCAN_TXBCF_CF6_Pos                    _UINT32_(6)                                          /* (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 6 Position */
#define MCAN_TXBCF_CF6_Msk                    (_UINT32_(0x1) << MCAN_TXBCF_CF6_Pos)                /* (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 6 Mask */
#define MCAN_TXBCF_CF6(value)                 (MCAN_TXBCF_CF6_Msk & (_UINT32_(value) << MCAN_TXBCF_CF6_Pos)) /* Assigment of value for CF6 in the MCAN_TXBCF register */
#define MCAN_TXBCF_CF7_Pos                    _UINT32_(7)                                          /* (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 7 Position */
#define MCAN_TXBCF_CF7_Msk                    (_UINT32_(0x1) << MCAN_TXBCF_CF7_Pos)                /* (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 7 Mask */
#define MCAN_TXBCF_CF7(value)                 (MCAN_TXBCF_CF7_Msk & (_UINT32_(value) << MCAN_TXBCF_CF7_Pos)) /* Assigment of value for CF7 in the MCAN_TXBCF register */
#define MCAN_TXBCF_CF8_Pos                    _UINT32_(8)                                          /* (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 8 Position */
#define MCAN_TXBCF_CF8_Msk                    (_UINT32_(0x1) << MCAN_TXBCF_CF8_Pos)                /* (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 8 Mask */
#define MCAN_TXBCF_CF8(value)                 (MCAN_TXBCF_CF8_Msk & (_UINT32_(value) << MCAN_TXBCF_CF8_Pos)) /* Assigment of value for CF8 in the MCAN_TXBCF register */
#define MCAN_TXBCF_CF9_Pos                    _UINT32_(9)                                          /* (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 9 Position */
#define MCAN_TXBCF_CF9_Msk                    (_UINT32_(0x1) << MCAN_TXBCF_CF9_Pos)                /* (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 9 Mask */
#define MCAN_TXBCF_CF9(value)                 (MCAN_TXBCF_CF9_Msk & (_UINT32_(value) << MCAN_TXBCF_CF9_Pos)) /* Assigment of value for CF9 in the MCAN_TXBCF register */
#define MCAN_TXBCF_CF10_Pos                   _UINT32_(10)                                         /* (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 10 Position */
#define MCAN_TXBCF_CF10_Msk                   (_UINT32_(0x1) << MCAN_TXBCF_CF10_Pos)               /* (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 10 Mask */
#define MCAN_TXBCF_CF10(value)                (MCAN_TXBCF_CF10_Msk & (_UINT32_(value) << MCAN_TXBCF_CF10_Pos)) /* Assigment of value for CF10 in the MCAN_TXBCF register */
#define MCAN_TXBCF_CF11_Pos                   _UINT32_(11)                                         /* (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 11 Position */
#define MCAN_TXBCF_CF11_Msk                   (_UINT32_(0x1) << MCAN_TXBCF_CF11_Pos)               /* (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 11 Mask */
#define MCAN_TXBCF_CF11(value)                (MCAN_TXBCF_CF11_Msk & (_UINT32_(value) << MCAN_TXBCF_CF11_Pos)) /* Assigment of value for CF11 in the MCAN_TXBCF register */
#define MCAN_TXBCF_CF12_Pos                   _UINT32_(12)                                         /* (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 12 Position */
#define MCAN_TXBCF_CF12_Msk                   (_UINT32_(0x1) << MCAN_TXBCF_CF12_Pos)               /* (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 12 Mask */
#define MCAN_TXBCF_CF12(value)                (MCAN_TXBCF_CF12_Msk & (_UINT32_(value) << MCAN_TXBCF_CF12_Pos)) /* Assigment of value for CF12 in the MCAN_TXBCF register */
#define MCAN_TXBCF_CF13_Pos                   _UINT32_(13)                                         /* (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 13 Position */
#define MCAN_TXBCF_CF13_Msk                   (_UINT32_(0x1) << MCAN_TXBCF_CF13_Pos)               /* (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 13 Mask */
#define MCAN_TXBCF_CF13(value)                (MCAN_TXBCF_CF13_Msk & (_UINT32_(value) << MCAN_TXBCF_CF13_Pos)) /* Assigment of value for CF13 in the MCAN_TXBCF register */
#define MCAN_TXBCF_CF14_Pos                   _UINT32_(14)                                         /* (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 14 Position */
#define MCAN_TXBCF_CF14_Msk                   (_UINT32_(0x1) << MCAN_TXBCF_CF14_Pos)               /* (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 14 Mask */
#define MCAN_TXBCF_CF14(value)                (MCAN_TXBCF_CF14_Msk & (_UINT32_(value) << MCAN_TXBCF_CF14_Pos)) /* Assigment of value for CF14 in the MCAN_TXBCF register */
#define MCAN_TXBCF_CF15_Pos                   _UINT32_(15)                                         /* (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 15 Position */
#define MCAN_TXBCF_CF15_Msk                   (_UINT32_(0x1) << MCAN_TXBCF_CF15_Pos)               /* (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 15 Mask */
#define MCAN_TXBCF_CF15(value)                (MCAN_TXBCF_CF15_Msk & (_UINT32_(value) << MCAN_TXBCF_CF15_Pos)) /* Assigment of value for CF15 in the MCAN_TXBCF register */
#define MCAN_TXBCF_CF16_Pos                   _UINT32_(16)                                         /* (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 16 Position */
#define MCAN_TXBCF_CF16_Msk                   (_UINT32_(0x1) << MCAN_TXBCF_CF16_Pos)               /* (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 16 Mask */
#define MCAN_TXBCF_CF16(value)                (MCAN_TXBCF_CF16_Msk & (_UINT32_(value) << MCAN_TXBCF_CF16_Pos)) /* Assigment of value for CF16 in the MCAN_TXBCF register */
#define MCAN_TXBCF_CF17_Pos                   _UINT32_(17)                                         /* (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 17 Position */
#define MCAN_TXBCF_CF17_Msk                   (_UINT32_(0x1) << MCAN_TXBCF_CF17_Pos)               /* (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 17 Mask */
#define MCAN_TXBCF_CF17(value)                (MCAN_TXBCF_CF17_Msk & (_UINT32_(value) << MCAN_TXBCF_CF17_Pos)) /* Assigment of value for CF17 in the MCAN_TXBCF register */
#define MCAN_TXBCF_CF18_Pos                   _UINT32_(18)                                         /* (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 18 Position */
#define MCAN_TXBCF_CF18_Msk                   (_UINT32_(0x1) << MCAN_TXBCF_CF18_Pos)               /* (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 18 Mask */
#define MCAN_TXBCF_CF18(value)                (MCAN_TXBCF_CF18_Msk & (_UINT32_(value) << MCAN_TXBCF_CF18_Pos)) /* Assigment of value for CF18 in the MCAN_TXBCF register */
#define MCAN_TXBCF_CF19_Pos                   _UINT32_(19)                                         /* (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 19 Position */
#define MCAN_TXBCF_CF19_Msk                   (_UINT32_(0x1) << MCAN_TXBCF_CF19_Pos)               /* (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 19 Mask */
#define MCAN_TXBCF_CF19(value)                (MCAN_TXBCF_CF19_Msk & (_UINT32_(value) << MCAN_TXBCF_CF19_Pos)) /* Assigment of value for CF19 in the MCAN_TXBCF register */
#define MCAN_TXBCF_CF20_Pos                   _UINT32_(20)                                         /* (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 20 Position */
#define MCAN_TXBCF_CF20_Msk                   (_UINT32_(0x1) << MCAN_TXBCF_CF20_Pos)               /* (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 20 Mask */
#define MCAN_TXBCF_CF20(value)                (MCAN_TXBCF_CF20_Msk & (_UINT32_(value) << MCAN_TXBCF_CF20_Pos)) /* Assigment of value for CF20 in the MCAN_TXBCF register */
#define MCAN_TXBCF_CF21_Pos                   _UINT32_(21)                                         /* (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 21 Position */
#define MCAN_TXBCF_CF21_Msk                   (_UINT32_(0x1) << MCAN_TXBCF_CF21_Pos)               /* (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 21 Mask */
#define MCAN_TXBCF_CF21(value)                (MCAN_TXBCF_CF21_Msk & (_UINT32_(value) << MCAN_TXBCF_CF21_Pos)) /* Assigment of value for CF21 in the MCAN_TXBCF register */
#define MCAN_TXBCF_CF22_Pos                   _UINT32_(22)                                         /* (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 22 Position */
#define MCAN_TXBCF_CF22_Msk                   (_UINT32_(0x1) << MCAN_TXBCF_CF22_Pos)               /* (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 22 Mask */
#define MCAN_TXBCF_CF22(value)                (MCAN_TXBCF_CF22_Msk & (_UINT32_(value) << MCAN_TXBCF_CF22_Pos)) /* Assigment of value for CF22 in the MCAN_TXBCF register */
#define MCAN_TXBCF_CF23_Pos                   _UINT32_(23)                                         /* (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 23 Position */
#define MCAN_TXBCF_CF23_Msk                   (_UINT32_(0x1) << MCAN_TXBCF_CF23_Pos)               /* (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 23 Mask */
#define MCAN_TXBCF_CF23(value)                (MCAN_TXBCF_CF23_Msk & (_UINT32_(value) << MCAN_TXBCF_CF23_Pos)) /* Assigment of value for CF23 in the MCAN_TXBCF register */
#define MCAN_TXBCF_CF24_Pos                   _UINT32_(24)                                         /* (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 24 Position */
#define MCAN_TXBCF_CF24_Msk                   (_UINT32_(0x1) << MCAN_TXBCF_CF24_Pos)               /* (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 24 Mask */
#define MCAN_TXBCF_CF24(value)                (MCAN_TXBCF_CF24_Msk & (_UINT32_(value) << MCAN_TXBCF_CF24_Pos)) /* Assigment of value for CF24 in the MCAN_TXBCF register */
#define MCAN_TXBCF_CF25_Pos                   _UINT32_(25)                                         /* (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 25 Position */
#define MCAN_TXBCF_CF25_Msk                   (_UINT32_(0x1) << MCAN_TXBCF_CF25_Pos)               /* (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 25 Mask */
#define MCAN_TXBCF_CF25(value)                (MCAN_TXBCF_CF25_Msk & (_UINT32_(value) << MCAN_TXBCF_CF25_Pos)) /* Assigment of value for CF25 in the MCAN_TXBCF register */
#define MCAN_TXBCF_CF26_Pos                   _UINT32_(26)                                         /* (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 26 Position */
#define MCAN_TXBCF_CF26_Msk                   (_UINT32_(0x1) << MCAN_TXBCF_CF26_Pos)               /* (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 26 Mask */
#define MCAN_TXBCF_CF26(value)                (MCAN_TXBCF_CF26_Msk & (_UINT32_(value) << MCAN_TXBCF_CF26_Pos)) /* Assigment of value for CF26 in the MCAN_TXBCF register */
#define MCAN_TXBCF_CF27_Pos                   _UINT32_(27)                                         /* (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 27 Position */
#define MCAN_TXBCF_CF27_Msk                   (_UINT32_(0x1) << MCAN_TXBCF_CF27_Pos)               /* (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 27 Mask */
#define MCAN_TXBCF_CF27(value)                (MCAN_TXBCF_CF27_Msk & (_UINT32_(value) << MCAN_TXBCF_CF27_Pos)) /* Assigment of value for CF27 in the MCAN_TXBCF register */
#define MCAN_TXBCF_CF28_Pos                   _UINT32_(28)                                         /* (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 28 Position */
#define MCAN_TXBCF_CF28_Msk                   (_UINT32_(0x1) << MCAN_TXBCF_CF28_Pos)               /* (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 28 Mask */
#define MCAN_TXBCF_CF28(value)                (MCAN_TXBCF_CF28_Msk & (_UINT32_(value) << MCAN_TXBCF_CF28_Pos)) /* Assigment of value for CF28 in the MCAN_TXBCF register */
#define MCAN_TXBCF_CF29_Pos                   _UINT32_(29)                                         /* (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 29 Position */
#define MCAN_TXBCF_CF29_Msk                   (_UINT32_(0x1) << MCAN_TXBCF_CF29_Pos)               /* (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 29 Mask */
#define MCAN_TXBCF_CF29(value)                (MCAN_TXBCF_CF29_Msk & (_UINT32_(value) << MCAN_TXBCF_CF29_Pos)) /* Assigment of value for CF29 in the MCAN_TXBCF register */
#define MCAN_TXBCF_CF30_Pos                   _UINT32_(30)                                         /* (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 30 Position */
#define MCAN_TXBCF_CF30_Msk                   (_UINT32_(0x1) << MCAN_TXBCF_CF30_Pos)               /* (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 30 Mask */
#define MCAN_TXBCF_CF30(value)                (MCAN_TXBCF_CF30_Msk & (_UINT32_(value) << MCAN_TXBCF_CF30_Pos)) /* Assigment of value for CF30 in the MCAN_TXBCF register */
#define MCAN_TXBCF_CF31_Pos                   _UINT32_(31)                                         /* (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 31 Position */
#define MCAN_TXBCF_CF31_Msk                   (_UINT32_(0x1) << MCAN_TXBCF_CF31_Pos)               /* (MCAN_TXBCF) Cancellation Finished for Transmit Buffer 31 Mask */
#define MCAN_TXBCF_CF31(value)                (MCAN_TXBCF_CF31_Msk & (_UINT32_(value) << MCAN_TXBCF_CF31_Pos)) /* Assigment of value for CF31 in the MCAN_TXBCF register */
#define MCAN_TXBCF_Msk                        _UINT32_(0xFFFFFFFF)                                 /* (MCAN_TXBCF) Register Mask  */

