Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/firmware/src/packs/PIC32CZ2051CA70144_DFP/component/mcan.h
/* -------- MCAN_TXBCIE : (MCAN Offset: 0xE4) (R/W 32) Transmit Buffer Cancellation Finished Interrupt Enable Register -------- */
#define MCAN_TXBCIE_CFIE0_Pos                 _UINT32_(0)                                          /* (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 0 Position */
#define MCAN_TXBCIE_CFIE0_Msk                 (_UINT32_(0x1) << MCAN_TXBCIE_CFIE0_Pos)             /* (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 0 Mask */
#define MCAN_TXBCIE_CFIE0(value)              (MCAN_TXBCIE_CFIE0_Msk & (_UINT32_(value) << MCAN_TXBCIE_CFIE0_Pos)) /* Assigment of value for CFIE0 in the MCAN_TXBCIE register */
#define MCAN_TXBCIE_CFIE1_Pos                 _UINT32_(1)                                          /* (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 1 Position */
#define MCAN_TXBCIE_CFIE1_Msk                 (_UINT32_(0x1) << MCAN_TXBCIE_CFIE1_Pos)             /* (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 1 Mask */
#define MCAN_TXBCIE_CFIE1(value)              (MCAN_TXBCIE_CFIE1_Msk & (_UINT32_(value) << MCAN_TXBCIE_CFIE1_Pos)) /* Assigment of value for CFIE1 in the MCAN_TXBCIE register */
#define MCAN_TXBCIE_CFIE2_Pos                 _UINT32_(2)                                          /* (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 2 Position */
#define MCAN_TXBCIE_CFIE2_Msk                 (_UINT32_(0x1) << MCAN_TXBCIE_CFIE2_Pos)             /* (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 2 Mask */
#define MCAN_TXBCIE_CFIE2(value)              (MCAN_TXBCIE_CFIE2_Msk & (_UINT32_(value) << MCAN_TXBCIE_CFIE2_Pos)) /* Assigment of value for CFIE2 in the MCAN_TXBCIE register */
#define MCAN_TXBCIE_CFIE3_Pos                 _UINT32_(3)                                          /* (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 3 Position */
#define MCAN_TXBCIE_CFIE3_Msk                 (_UINT32_(0x1) << MCAN_TXBCIE_CFIE3_Pos)             /* (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 3 Mask */
#define MCAN_TXBCIE_CFIE3(value)              (MCAN_TXBCIE_CFIE3_Msk & (_UINT32_(value) << MCAN_TXBCIE_CFIE3_Pos)) /* Assigment of value for CFIE3 in the MCAN_TXBCIE register */
#define MCAN_TXBCIE_CFIE4_Pos                 _UINT32_(4)                                          /* (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 4 Position */
#define MCAN_TXBCIE_CFIE4_Msk                 (_UINT32_(0x1) << MCAN_TXBCIE_CFIE4_Pos)             /* (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 4 Mask */
#define MCAN_TXBCIE_CFIE4(value)              (MCAN_TXBCIE_CFIE4_Msk & (_UINT32_(value) << MCAN_TXBCIE_CFIE4_Pos)) /* Assigment of value for CFIE4 in the MCAN_TXBCIE register */
#define MCAN_TXBCIE_CFIE5_Pos                 _UINT32_(5)                                          /* (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 5 Position */
#define MCAN_TXBCIE_CFIE5_Msk                 (_UINT32_(0x1) << MCAN_TXBCIE_CFIE5_Pos)             /* (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 5 Mask */
#define MCAN_TXBCIE_CFIE5(value)              (MCAN_TXBCIE_CFIE5_Msk & (_UINT32_(value) << MCAN_TXBCIE_CFIE5_Pos)) /* Assigment of value for CFIE5 in the MCAN_TXBCIE register */
#define MCAN_TXBCIE_CFIE6_Pos                 _UINT32_(6)                                          /* (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 6 Position */
#define MCAN_TXBCIE_CFIE6_Msk                 (_UINT32_(0x1) << MCAN_TXBCIE_CFIE6_Pos)             /* (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 6 Mask */
#define MCAN_TXBCIE_CFIE6(value)              (MCAN_TXBCIE_CFIE6_Msk & (_UINT32_(value) << MCAN_TXBCIE_CFIE6_Pos)) /* Assigment of value for CFIE6 in the MCAN_TXBCIE register */
#define MCAN_TXBCIE_CFIE7_Pos                 _UINT32_(7)                                          /* (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 7 Position */
#define MCAN_TXBCIE_CFIE7_Msk                 (_UINT32_(0x1) << MCAN_TXBCIE_CFIE7_Pos)             /* (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 7 Mask */
#define MCAN_TXBCIE_CFIE7(value)              (MCAN_TXBCIE_CFIE7_Msk & (_UINT32_(value) << MCAN_TXBCIE_CFIE7_Pos)) /* Assigment of value for CFIE7 in the MCAN_TXBCIE register */
#define MCAN_TXBCIE_CFIE8_Pos                 _UINT32_(8)                                          /* (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 8 Position */
#define MCAN_TXBCIE_CFIE8_Msk                 (_UINT32_(0x1) << MCAN_TXBCIE_CFIE8_Pos)             /* (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 8 Mask */
#define MCAN_TXBCIE_CFIE8(value)              (MCAN_TXBCIE_CFIE8_Msk & (_UINT32_(value) << MCAN_TXBCIE_CFIE8_Pos)) /* Assigment of value for CFIE8 in the MCAN_TXBCIE register */
#define MCAN_TXBCIE_CFIE9_Pos                 _UINT32_(9)                                          /* (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 9 Position */
#define MCAN_TXBCIE_CFIE9_Msk                 (_UINT32_(0x1) << MCAN_TXBCIE_CFIE9_Pos)             /* (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 9 Mask */
#define MCAN_TXBCIE_CFIE9(value)              (MCAN_TXBCIE_CFIE9_Msk & (_UINT32_(value) << MCAN_TXBCIE_CFIE9_Pos)) /* Assigment of value for CFIE9 in the MCAN_TXBCIE register */
#define MCAN_TXBCIE_CFIE10_Pos                _UINT32_(10)                                         /* (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 10 Position */
#define MCAN_TXBCIE_CFIE10_Msk                (_UINT32_(0x1) << MCAN_TXBCIE_CFIE10_Pos)            /* (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 10 Mask */
#define MCAN_TXBCIE_CFIE10(value)             (MCAN_TXBCIE_CFIE10_Msk & (_UINT32_(value) << MCAN_TXBCIE_CFIE10_Pos)) /* Assigment of value for CFIE10 in the MCAN_TXBCIE register */
#define MCAN_TXBCIE_CFIE11_Pos                _UINT32_(11)                                         /* (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 11 Position */
#define MCAN_TXBCIE_CFIE11_Msk                (_UINT32_(0x1) << MCAN_TXBCIE_CFIE11_Pos)            /* (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 11 Mask */
#define MCAN_TXBCIE_CFIE11(value)             (MCAN_TXBCIE_CFIE11_Msk & (_UINT32_(value) << MCAN_TXBCIE_CFIE11_Pos)) /* Assigment of value for CFIE11 in the MCAN_TXBCIE register */
#define MCAN_TXBCIE_CFIE12_Pos                _UINT32_(12)                                         /* (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 12 Position */
#define MCAN_TXBCIE_CFIE12_Msk                (_UINT32_(0x1) << MCAN_TXBCIE_CFIE12_Pos)            /* (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 12 Mask */
#define MCAN_TXBCIE_CFIE12(value)             (MCAN_TXBCIE_CFIE12_Msk & (_UINT32_(value) << MCAN_TXBCIE_CFIE12_Pos)) /* Assigment of value for CFIE12 in the MCAN_TXBCIE register */
#define MCAN_TXBCIE_CFIE13_Pos                _UINT32_(13)                                         /* (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 13 Position */
#define MCAN_TXBCIE_CFIE13_Msk                (_UINT32_(0x1) << MCAN_TXBCIE_CFIE13_Pos)            /* (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 13 Mask */
#define MCAN_TXBCIE_CFIE13(value)             (MCAN_TXBCIE_CFIE13_Msk & (_UINT32_(value) << MCAN_TXBCIE_CFIE13_Pos)) /* Assigment of value for CFIE13 in the MCAN_TXBCIE register */
#define MCAN_TXBCIE_CFIE14_Pos                _UINT32_(14)                                         /* (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 14 Position */
#define MCAN_TXBCIE_CFIE14_Msk                (_UINT32_(0x1) << MCAN_TXBCIE_CFIE14_Pos)            /* (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 14 Mask */
#define MCAN_TXBCIE_CFIE14(value)             (MCAN_TXBCIE_CFIE14_Msk & (_UINT32_(value) << MCAN_TXBCIE_CFIE14_Pos)) /* Assigment of value for CFIE14 in the MCAN_TXBCIE register */
#define MCAN_TXBCIE_CFIE15_Pos                _UINT32_(15)                                         /* (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 15 Position */
#define MCAN_TXBCIE_CFIE15_Msk                (_UINT32_(0x1) << MCAN_TXBCIE_CFIE15_Pos)            /* (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 15 Mask */
#define MCAN_TXBCIE_CFIE15(value)             (MCAN_TXBCIE_CFIE15_Msk & (_UINT32_(value) << MCAN_TXBCIE_CFIE15_Pos)) /* Assigment of value for CFIE15 in the MCAN_TXBCIE register */
#define MCAN_TXBCIE_CFIE16_Pos                _UINT32_(16)                                         /* (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 16 Position */
#define MCAN_TXBCIE_CFIE16_Msk                (_UINT32_(0x1) << MCAN_TXBCIE_CFIE16_Pos)            /* (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 16 Mask */
#define MCAN_TXBCIE_CFIE16(value)             (MCAN_TXBCIE_CFIE16_Msk & (_UINT32_(value) << MCAN_TXBCIE_CFIE16_Pos)) /* Assigment of value for CFIE16 in the MCAN_TXBCIE register */
#define MCAN_TXBCIE_CFIE17_Pos                _UINT32_(17)                                         /* (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 17 Position */
#define MCAN_TXBCIE_CFIE17_Msk                (_UINT32_(0x1) << MCAN_TXBCIE_CFIE17_Pos)            /* (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 17 Mask */
#define MCAN_TXBCIE_CFIE17(value)             (MCAN_TXBCIE_CFIE17_Msk & (_UINT32_(value) << MCAN_TXBCIE_CFIE17_Pos)) /* Assigment of value for CFIE17 in the MCAN_TXBCIE register */
#define MCAN_TXBCIE_CFIE18_Pos                _UINT32_(18)                                         /* (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 18 Position */
#define MCAN_TXBCIE_CFIE18_Msk                (_UINT32_(0x1) << MCAN_TXBCIE_CFIE18_Pos)            /* (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 18 Mask */
#define MCAN_TXBCIE_CFIE18(value)             (MCAN_TXBCIE_CFIE18_Msk & (_UINT32_(value) << MCAN_TXBCIE_CFIE18_Pos)) /* Assigment of value for CFIE18 in the MCAN_TXBCIE register */
#define MCAN_TXBCIE_CFIE19_Pos                _UINT32_(19)                                         /* (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 19 Position */
#define MCAN_TXBCIE_CFIE19_Msk                (_UINT32_(0x1) << MCAN_TXBCIE_CFIE19_Pos)            /* (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 19 Mask */
#define MCAN_TXBCIE_CFIE19(value)             (MCAN_TXBCIE_CFIE19_Msk & (_UINT32_(value) << MCAN_TXBCIE_CFIE19_Pos)) /* Assigment of value for CFIE19 in the MCAN_TXBCIE register */
#define MCAN_TXBCIE_CFIE20_Pos                _UINT32_(20)                                         /* (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 20 Position */
#define MCAN_TXBCIE_CFIE20_Msk                (_UINT32_(0x1) << MCAN_TXBCIE_CFIE20_Pos)            /* (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 20 Mask */
#define MCAN_TXBCIE_CFIE20(value)             (MCAN_TXBCIE_CFIE20_Msk & (_UINT32_(value) << MCAN_TXBCIE_CFIE20_Pos)) /* Assigment of value for CFIE20 in the MCAN_TXBCIE register */
#define MCAN_TXBCIE_CFIE21_Pos                _UINT32_(21)                                         /* (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 21 Position */
#define MCAN_TXBCIE_CFIE21_Msk                (_UINT32_(0x1) << MCAN_TXBCIE_CFIE21_Pos)            /* (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 21 Mask */
#define MCAN_TXBCIE_CFIE21(value)             (MCAN_TXBCIE_CFIE21_Msk & (_UINT32_(value) << MCAN_TXBCIE_CFIE21_Pos)) /* Assigment of value for CFIE21 in the MCAN_TXBCIE register */
#define MCAN_TXBCIE_CFIE22_Pos                _UINT32_(22)                                         /* (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 22 Position */
#define MCAN_TXBCIE_CFIE22_Msk                (_UINT32_(0x1) << MCAN_TXBCIE_CFIE22_Pos)            /* (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 22 Mask */
#define MCAN_TXBCIE_CFIE22(value)             (MCAN_TXBCIE_CFIE22_Msk & (_UINT32_(value) << MCAN_TXBCIE_CFIE22_Pos)) /* Assigment of value for CFIE22 in the MCAN_TXBCIE register */
#define MCAN_TXBCIE_CFIE23_Pos                _UINT32_(23)                                         /* (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 23 Position */
#define MCAN_TXBCIE_CFIE23_Msk                (_UINT32_(0x1) << MCAN_TXBCIE_CFIE23_Pos)            /* (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 23 Mask */
#define MCAN_TXBCIE_CFIE23(value)             (MCAN_TXBCIE_CFIE23_Msk & (_UINT32_(value) << MCAN_TXBCIE_CFIE23_Pos)) /* Assigment of value for CFIE23 in the MCAN_TXBCIE register */
#define MCAN_TXBCIE_CFIE24_Pos                _UINT32_(24)                                         /* (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 24 Position */
#define MCAN_TXBCIE_CFIE24_Msk                (_UINT32_(0x1) << MCAN_TXBCIE_CFIE24_Pos)            /* (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 24 Mask */
#define MCAN_TXBCIE_CFIE24(value)             (MCAN_TXBCIE_CFIE24_Msk & (_UINT32_(value) << MCAN_TXBCIE_CFIE24_Pos)) /* Assigment of value for CFIE24 in the MCAN_TXBCIE register */
#define MCAN_TXBCIE_CFIE25_Pos                _UINT32_(25)                                         /* (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 25 Position */
#define MCAN_TXBCIE_CFIE25_Msk                (_UINT32_(0x1) << MCAN_TXBCIE_CFIE25_Pos)            /* (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 25 Mask */
#define MCAN_TXBCIE_CFIE25(value)             (MCAN_TXBCIE_CFIE25_Msk & (_UINT32_(value) << MCAN_TXBCIE_CFIE25_Pos)) /* Assigment of value for CFIE25 in the MCAN_TXBCIE register */
#define MCAN_TXBCIE_CFIE26_Pos                _UINT32_(26)                                         /* (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 26 Position */
#define MCAN_TXBCIE_CFIE26_Msk                (_UINT32_(0x1) << MCAN_TXBCIE_CFIE26_Pos)            /* (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 26 Mask */
#define MCAN_TXBCIE_CFIE26(value)             (MCAN_TXBCIE_CFIE26_Msk & (_UINT32_(value) << MCAN_TXBCIE_CFIE26_Pos)) /* Assigment of value for CFIE26 in the MCAN_TXBCIE register */
#define MCAN_TXBCIE_CFIE27_Pos                _UINT32_(27)                                         /* (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 27 Position */
#define MCAN_TXBCIE_CFIE27_Msk                (_UINT32_(0x1) << MCAN_TXBCIE_CFIE27_Pos)            /* (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 27 Mask */
#define MCAN_TXBCIE_CFIE27(value)             (MCAN_TXBCIE_CFIE27_Msk & (_UINT32_(value) << MCAN_TXBCIE_CFIE27_Pos)) /* Assigment of value for CFIE27 in the MCAN_TXBCIE register */
#define MCAN_TXBCIE_CFIE28_Pos                _UINT32_(28)                                         /* (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 28 Position */
#define MCAN_TXBCIE_CFIE28_Msk                (_UINT32_(0x1) << MCAN_TXBCIE_CFIE28_Pos)            /* (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 28 Mask */
#define MCAN_TXBCIE_CFIE28(value)             (MCAN_TXBCIE_CFIE28_Msk & (_UINT32_(value) << MCAN_TXBCIE_CFIE28_Pos)) /* Assigment of value for CFIE28 in the MCAN_TXBCIE register */
#define MCAN_TXBCIE_CFIE29_Pos                _UINT32_(29)                                         /* (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 29 Position */
#define MCAN_TXBCIE_CFIE29_Msk                (_UINT32_(0x1) << MCAN_TXBCIE_CFIE29_Pos)            /* (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 29 Mask */
#define MCAN_TXBCIE_CFIE29(value)             (MCAN_TXBCIE_CFIE29_Msk & (_UINT32_(value) << MCAN_TXBCIE_CFIE29_Pos)) /* Assigment of value for CFIE29 in the MCAN_TXBCIE register */
#define MCAN_TXBCIE_CFIE30_Pos                _UINT32_(30)                                         /* (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 30 Position */
#define MCAN_TXBCIE_CFIE30_Msk                (_UINT32_(0x1) << MCAN_TXBCIE_CFIE30_Pos)            /* (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 30 Mask */
#define MCAN_TXBCIE_CFIE30(value)             (MCAN_TXBCIE_CFIE30_Msk & (_UINT32_(value) << MCAN_TXBCIE_CFIE30_Pos)) /* Assigment of value for CFIE30 in the MCAN_TXBCIE register */
#define MCAN_TXBCIE_CFIE31_Pos                _UINT32_(31)                                         /* (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 31 Position */
#define MCAN_TXBCIE_CFIE31_Msk                (_UINT32_(0x1) << MCAN_TXBCIE_CFIE31_Pos)            /* (MCAN_TXBCIE) Cancellation Finished Interrupt Enable for Transmit Buffer 31 Mask */
#define MCAN_TXBCIE_CFIE31(value)             (MCAN_TXBCIE_CFIE31_Msk & (_UINT32_(value) << MCAN_TXBCIE_CFIE31_Pos)) /* Assigment of value for CFIE31 in the MCAN_TXBCIE register */
#define MCAN_TXBCIE_Msk                       _UINT32_(0xFFFFFFFF)                                 /* (MCAN_TXBCIE) Register Mask  */

